13) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:104    [M] DecrementInteger

--- Original
+++ New
@@ @@
      * @param callable $function
      * @return self
      */
-    public function filter(callable $function, int $mode = 0) : self
+    public function filter(callable $function, int $mode = -1) : self
     {
         return new static(array_filter($this->data, $function, $mode));
     }

14) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:104    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      * @param callable $function
      * @return self
      */
-    public function filter(callable $function, int $mode = 0) : self
+    public function filter(callable $function, int $mode = 1) : self
     {
         return new static(array_filter($this->data, $function, $mode));
     }

15) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:149    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (!is_array($data) && !is_a($data, static::class)) {
             throw new TypeError('Can only merge with other Collections or Arrays.');
         }
-        return new static(array_merge($this->data, is_object($data) && is_a($data, static::class) ? $data->to_array() : $data));
+        return new static(array_merge($this->data, is_object($data) || is_a($data, static::class) ? $data->to_array() : $data));
     }
     /**
      * Pushes an item to the collection and reutrns a new instance.

16) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:175    [M] OneZeroInteger

--- Original
+++ New
@@ @@
     public function pop()
     {
         if (empty($this->data)) {
-            throw new \UnderflowException('Collection is empty, can not extract value.', 1);
+            throw new \UnderflowException('Collection is empty, can not extract value.', 0);
         }
         return \array_pop($this->data);
     }

18) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:188    [M] IncrementInteger

--- Original
+++ New
@@ @@
     public function shift()
     {
         if (empty($this->data)) {
-            throw new \UnderflowException('Collection is empty, can not extract value.', 1);
+            throw new \UnderflowException('Collection is empty, can not extract value.', 2);
         }
         return \array_shift($this->data);
     }

19) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:349    [M] UnwrapArrayIntersect

--- Original
+++ New
@@ @@
         if (!is_array($data) && !is_a($data, static::class)) {
             throw new \TypeError('Can only merge with other Collections or Arrays.');
         }
-        return new static(array_intersect($this->data, is_object($data) && is_a($data, static::class) ? $data->to_array() : $data));
+        return new static(is_object($data) && is_a($data, static::class) ? $data->to_array() : $data);
     }
 }

20) /shared/httpd/php/htdocs/pc_core/src/Collection/Collection.php:351    [M] LogicalAnd

--- Original
+++ New
@@ @@
         if (!is_array($data) && !is_a($data, static::class)) {
             throw new \TypeError('Can only merge with other Collections or Arrays.');
         }
-        return new static(array_intersect($this->data, is_object($data) && is_a($data, static::class) ? $data->to_array() : $data));
+        return new static(array_intersect($this->data, is_object($data) || is_a($data, static::class) ? $data->to_array() : $data));
     }
 }

23) /shared/httpd/php/htdocs/pc_core/src/Collection/Traits/Sequence.php:95    [M] UnwrapArrayValues

--- Original
+++ New
@@ @@
         if (empty($this->data)) {
             throw new UnderflowException('Collection is empty, can not get last value');
         }
-        return array_values($this->data)[count($this->data) - 1];
+        return ($this->data)[count($this->data) - 1];
     }
     /**
      * Returns a sum of all the elements.

24) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:73    [M] LogicalOr

--- Original
+++ New
@@ @@
      */
     public function remove() : bool
     {
-        if (!$this->has_hook() || $this->is_callback_closure()) {
+        if (!$this->has_hook() && $this->is_callback_closure()) {
             return false;
         }
         $removed = false;

25) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:77    [M] FalseValue

--- Original
+++ New
@@ @@
         if (!$this->has_hook() || $this->is_callback_closure()) {
             return false;
         }
-        $removed = false;
+        $removed = true;
         foreach ($this->registered_hooks() as $key => $registered_callback) {
             // Is class.
             if (is_array($registered_callback['function']) && count($registered_callback['function']) === 2 && $this->matching_class_callback($registered_callback)) {

26) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:81    [M] LogicalAnd

--- Original
+++ New
@@ @@
         $removed = false;
         foreach ($this->registered_hooks() as $key => $registered_callback) {
             // Is class.
-            if (is_array($registered_callback['function']) && count($registered_callback['function']) === 2 && $this->matching_class_callback($registered_callback)) {
+            if (is_array($registered_callback['function']) && count($registered_callback['function']) === 2 || $this->matching_class_callback($registered_callback)) {
                 unset($this->registered_hooks[$this->handle]->callbacks[$this->priority][$key]);
                 $removed = true;
             }

27) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:89    [M] LogicalAnd

--- Original
+++ New
@@ @@
                 $removed = true;
             }
             // Is global function
-            if (is_string($registered_callback['function']) && $this->matching_function_callback($registered_callback)) {
+            if (is_string($registered_callback['function']) || $this->matching_function_callback($registered_callback)) {
                 unset($this->registered_hooks[$this->handle]->callbacks[$this->priority][$key]);
                 $removed = true;
             }

28) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:106    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param array<string, array|string> $registered_callback
      * @return bool
      */
-    protected function matching_function_callback(array $registered_callback) : bool
+    private function matching_function_callback(array $registered_callback) : bool
     {
         return is_string($this->callback) && is_string($registered_callback['function']) && strcmp($registered_callback['function'], $this->callback) === 0;
     }

29) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:107    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function matching_function_callback(array $registered_callback) : bool
     {
-        return is_string($this->callback) && is_string($registered_callback['function']) && strcmp($registered_callback['function'], $this->callback) === 0;
+        return is_string($this->callback) && is_string($registered_callback['function']) || strcmp($registered_callback['function'], $this->callback) === 0;
     }
     /**
      * Checks if a registered callback matches defined class.

30) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:107    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function matching_function_callback(array $registered_callback) : bool
     {
-        return is_string($this->callback) && is_string($registered_callback['function']) && strcmp($registered_callback['function'], $this->callback) === 0;
+        return (is_string($this->callback) || is_string($registered_callback['function'])) && strcmp($registered_callback['function'], $this->callback) === 0;
     }
     /**
      * Checks if a registered callback matches defined class.

31) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:120    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param array<string, array> $registered_callback
      * @return bool
      */
-    protected function matching_class_callback(array $registered_callback) : bool
+    private function matching_class_callback(array $registered_callback) : bool
     {
         $registered_class = is_object($registered_callback['function'][0]) ? get_class($registered_callback['function'][0]) : $registered_callback['function'][0];
         $callback_class = $this->get_callback_as_array();

32) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:127    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $registered_class = is_object($registered_callback['function'][0]) ? get_class($registered_callback['function'][0]) : $registered_callback['function'][0];
         $callback_class = $this->get_callback_as_array();
-        return class_exists($callback_class['class']) && $registered_class === $callback_class['class'] && $registered_callback['function'][1] === $callback_class['method'];
+        return class_exists($callback_class['class']) && $registered_class === $callback_class['class'] || $registered_callback['function'][1] === $callback_class['method'];
     }
     /**
      * All registerd hooks on the defined handle and priority.

33) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:127    [M] LogicalAnd

--- Original
+++ New
@@ @@
     {
         $registered_class = is_object($registered_callback['function'][0]) ? get_class($registered_callback['function'][0]) : $registered_callback['function'][0];
         $callback_class = $this->get_callback_as_array();
-        return class_exists($callback_class['class']) && $registered_class === $callback_class['class'] && $registered_callback['function'][1] === $callback_class['method'];
+        return (class_exists($callback_class['class']) || $registered_class === $callback_class['class']) && $registered_callback['function'][1] === $callback_class['method'];
     }
     /**
      * All registerd hooks on the defined handle and priority.

34) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:137    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return array<string, array>
      */
-    protected function registered_hooks() : array
+    private function registered_hooks() : array
     {
         return array_filter($this->registered_hooks[$this->handle]->callbacks[$this->priority], function (array $callback) {
             return array_key_exists('function', $callback);

35) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:138    [M] UnwrapArrayFilter

--- Original
+++ New
@@ @@
      */
     protected function registered_hooks() : array
     {
-        return array_filter($this->registered_hooks[$this->handle]->callbacks[$this->priority], function (array $callback) {
-            return array_key_exists('function', $callback);
-        });
+        return $this->registered_hooks[$this->handle]->callbacks[$this->priority];
     }
     /**

36) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:151    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return array<string, string>
      */
-    protected function get_callback_as_array() : array
+    private function get_callback_as_array() : array
     {
         if (!is_array($this->callback)) {
             return array('class' => '', 'method' => '');

37) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:170    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      *
      * @return bool
      */
-    protected function is_callback_closure() : bool
+    private function is_callback_closure() : bool
     {
         return $this->callback instanceof Closure;
     }

38) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:180    [M] LogicalAnd

--- Original
+++ New
@@ @@
      */
     protected function has_hook() : bool
     {
-        return array_key_exists($this->handle, $this->registered_hooks) && array_key_exists($this->priority, $this->registered_hooks[$this->handle]->callbacks);
+        return array_key_exists($this->handle, $this->registered_hooks) || array_key_exists($this->priority, $this->registered_hooks[$this->handle]->callbacks);
     }
 }

41) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:108    [M] OneZeroInteger

--- Original
+++ New
@@ @@
      * @param integer    $args
      * @return void
      */
-    public function admin_action(string $handle, callable $method, int $priority = 10, int $args = 1) : void
+    public function admin_action(string $handle, callable $method, int $priority = 10, int $args = 0) : void
     {
         $this->admin->push(array('type' => 'action', 'handle' => $handle, 'method' => $method, 'priority' => $priority, 'args' => $args));
     }

45) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:129    [M] IncrementInteger

--- Original
+++ New
@@ @@
      * @param integer    $args
      * @return void
      */
-    public function admin_filter(string $handle, callable $method, int $priority = 10, int $args = 1)
+    public function admin_filter(string $handle, callable $method, int $priority = 10, int $args = 2)
     {
         $this->admin->push(array('type' => 'filter', 'handle' => $handle, 'method' => $method, 'priority' => $priority, 'args' => $args));
     }

62) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:287    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if (is_array($ajax)) {
                 // If public (none logged in users)
                 if ($ajax['public']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 11, 'args' => 1));
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {

63) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:288    [M] OneZeroInteger

--- Original
+++ New
@@ @@
             if (is_array($ajax)) {
                 // If public (none logged in users)
                 if ($ajax['public']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 0));
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {

64) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:288    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if (is_array($ajax)) {
                 // If public (none logged in users)
                 if ($ajax['public']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_nopriv_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 2));
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {

65) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:299    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 11, 'args' => 1));
                 }
             }
         });

66) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:299    [M] DecrementInteger

--- Original
+++ New
@@ @@
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 9, 'args' => 1));
                 }
             }
         });

67) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:300    [M] OneZeroInteger

--- Original
+++ New
@@ @@
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 0));
                 }
             }
         });

68) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Loader.php:300    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 }
                 // If private (logged in users only)
                 if ($ajax['private']) {
-                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 1));
+                    $this->global->push(array('type' => 'action', 'handle' => 'wp_ajax_' . $ajax['handle'], 'method' => $ajax['method'], 'priority' => 10, 'args' => 2));
                 }
             }
         });

71) /shared/httpd/php/htdocs/pc_core/src/Services/View/PHP_Engine.php:87    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @return string
      * @throws Exception
      */
-    protected function render_buffer(string $view, iterable $data) : string
+    private function render_buffer(string $view, iterable $data) : string
     {
         if (!file_exists($this->resolve_file_path($view))) {
             throw new Exception("{$view} doesnt exist");

72) /shared/httpd/php/htdocs/pc_core/src/Services/View/PHP_Engine.php:115    [M] ProtectedVisibility

--- Original
+++ New
@@ @@
      * @param string $file
      * @return string
      */
-    protected function clean_filename(string $file) : string
+    private function clean_filename(string $file) : string
     {
         $file = ltrim($file, '/');
         return substr($file, -4) === '.php' ? substr($file, 0, -4) : $file;

74) /shared/httpd/php/htdocs/pc_core/src/Services/View/View.php:72    [M] TrueValue

--- Original
+++ New
@@ @@
      * @param bool $print
      * @return string|void
      */
-    public function render(string $view, iterable $view_data, bool $print = true)
+    public function render(string $view, iterable $view_data, bool $print = false)
     {
         if ($print) {
             $this->engine->render($view, $view_data, self::PRINT_VIEW);

1) /shared/httpd/php/htdocs/pc_core/src/Services/Registration/Hook_Removal.php:153    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     protected function get_callback_as_array() : array
     {
         if (!is_array($this->callback)) {
-            return array('class' => '', 'method' => '');
+            return array('method' => '');
         }
         return array('class' => is_object($this->callback[0]) ? get_class($this->callback[0]) : $this->callback[0], 'method' => $this->callback[1]);
     }
