[Killed] PublicVisibility
Application/App.php:92:2
 	 *
 	 * @return bool
 	 */
-	public static function is_booted(): bool {
+	protected static function is_booted() : bool
 		return self::$booted;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
Error: Call to protected method PinkCrab\Perique\Application\App::is_booted() from context 'PinkCrab\Perique\Application\App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:83
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:56

[Killed] PublicVisibility
Application/App.php:104:2
 	 * @return self
 	 * @throws App_Initialization_Exception Code 2
 	 */
-	public function set_container( DI_Container $container ): self {
+	protected function set_container(DI_Container $container) : self
 		if ( self::$container !== null ) {
 			throw App_Initialization_Exception::di_container_exists();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
Error: Call to protected method PinkCrab\Perique\Application\App::set_container() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/App_Helper_Trait.php:65
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/

[Killed] NotIdentical
Application/App.php:105:3
 	 * @throws App_Initialization_Exception Code 2
 	 */
 	public function set_container( DI_Container $container ): self {
-		if ( self::$container !== null ) {
+		if (self::$container === null) {
 			throw App_Initialization_Exception::di_container_exists();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App already contains a DI Container, can not redeclare.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:49
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:97
/shared/httpd/php/ht

[Killed] Throw_
Application/App.php:106:4
 	 */
 	public function set_container( DI_Container $container ): self {
 		if ( self::$container !== null ) {
-			throw App_Initialization_Exception::di_container_exists();
+			App_Initialization_Exception::di_container_exists();
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
Failed asserting that exception of type "PinkCrab\Perique\Exceptions\App_Initialization_Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App.php:120:2
 	 * @return self
 	 * @throws App_Initialization_Exception Code 5
 	 */
-	public function set_app_config( array $settings ): self {
+	protected function set_app_config(array $settings) : self
 		if ( self::$app_config !== null ) {
 			throw App_Initialization_Exception::app_config_exists();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
Error: Call to protected method PinkCrab\Perique\Application\App::set_app_config() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/App_Helper_Trait.php:68
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application

[Killed] NotIdentical
Application/App.php:121:3
 	 * @throws App_Initialization_Exception Code 5
 	 */
 	public function set_app_config( array $settings ): self {
-		if ( self::$app_config !== null ) {
+		if (self::$app_config === null) {
 			throw App_Initialization_Exception::app_config_exists();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
PinkCrab\Perique\Exceptions\App_Initialization_Exception: Can not redeclare App_Config as its already set to the application

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:80
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:112
/shared/

[Killed] Throw_
Application/App.php:122:4
 	 */
 	public function set_app_config( array $settings ): self {
 		if ( self::$app_config !== null ) {
-			throw App_Initialization_Exception::app_config_exists();
+			App_Initialization_Exception::app_config_exists();
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
Failed asserting that exception of type "PinkCrab\Perique\Exceptions\App_Initialization_Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App.php:135:2
 	 * @param \PinkCrab\Perique\Services\Registration\Registration_Service $registration
 	 * @return self
 	 */
-	public function set_registration_services( Registration_Service $registration ): self {
+	protected function set_registration_services(Registration_Service $registration) : self
 		if ( $this->registration !== null ) {
 			throw App_Initialization_Exception::registration_exists();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
Error: Call to protected method PinkCrab\Perique\Application\App::set_registration_services() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/App_Helper_Trait.php:66
/shared/httpd/php/htdocs/Perqiue-Framework/tests/

[Killed] NotIdentical
Application/App.php:136:3
 	 * @return self
 	 */
 	public function set_registration_services( Registration_Service $registration ): self {
-		if ( $this->registration !== null ) {
+		if ($this->registration === null) {
 			throw App_Initialization_Exception::registration_exists();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
PinkCrab\Perique\Exceptions\App_Initialization_Exception: Can not redeclare Registration_Service as its already set to the application

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:90
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:12

[Killed] Throw_
Application/App.php:137:4
 	 */
 	public function set_registration_services( Registration_Service $registration ): self {
 		if ( $this->registration !== null ) {
-			throw App_Initialization_Exception::registration_exists();
+			App_Initialization_Exception::registration_exists();
 		}
 		$this->registration = $registration;
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
Failed asserting that exception of type "PinkCrab\Perique\Exceptions\App_Initialization_Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App.php:149:2
 	 * @param \PinkCrab\Loader\Hook_Loader $loader
 	 * @return self
 	 */
-	public function set_loader( Hook_Loader $loader ): self {
+	protected function set_loader(Hook_Loader $loader) : self
 		if ( $this->loader !== null ) {
 			throw App_Initialization_Exception::loader_exists();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
Error: Call to protected method PinkCrab\Perique\Application\App::set_loader() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/App_Helper_Trait.php:67
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Tes

[Killed] NotIdentical
Application/App.php:150:3
 	 * @return self
 	 */
 	public function set_loader( Hook_Loader $loader ): self {
-		if ( $this->loader !== null ) {
+		if ($this->loader === null) {
 			throw App_Initialization_Exception::loader_exists();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
PinkCrab\Perique\Exceptions\App_Initialization_Exception: Can not redeclare Loader as its already set to the application

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:114
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:140
/shared/htt

[Killed] Throw_
Application/App.php:151:4
 	 */
 	public function set_loader( Hook_Loader $loader ): self {
 		if ( $this->loader !== null ) {
-			throw App_Initialization_Exception::loader_exists();
+			App_Initialization_Exception::loader_exists();
 		}
 		$this->loader = $loader;
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
Failed asserting that exception of type "PinkCrab\Perique\Exceptions\App_Initialization_Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App.php:165:2
 	 * @return self
 	 * @throws App_Initialization_Exception Code 1
 	 */
-	public function container_config( callable $callback ): self {
+	protected function container_config(callable $callback) : self
 		if ( self::$container === null ) {
 			throw App_Initialization_Exception::requires_di_container();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
Error: Call to protected method PinkCrab\Perique\Application\App::container_config() from context 'PinkCrab\Perique\Application\App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:111
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:74
phpvfscomposer://

[Killed] Identical
Application/App.php:166:3
 	 * @throws App_Initialization_Exception Code 1
 	 */
 	public function container_config( callable $callback ): self {
-		if ( self::$container === null ) {
+		if (self::$container !== null) {
 			throw App_Initialization_Exception::requires_di_container();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
PinkCrab\Perique\Exceptions\App_Initialization_Exception: The Application must be populated with a DI_Container before booting.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:39
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:155
/shared/httpd/php/htdocs/Perq

[Killed] Throw_
Application/App.php:167:4
 	 */
 	public function container_config( callable $callback ): self {
 		if ( self::$container === null ) {
-			throw App_Initialization_Exception::requires_di_container();
+			App_Initialization_Exception::requires_di_container();
 		}
 		$callback( self::$container );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_container_config_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_container_config_exception
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:138
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:157
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:140
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

[Killed] FunctionCallRemoval
Application/App.php:169:3
 		if ( self::$container === null ) {
 			throw App_Initialization_Exception::requires_di_container();
 		}
-		$callback( self::$container );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:78
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App.php:180:2
 	 * @return self
 	 * @throws App_Initialization_Exception Code 3
 	 */
-	public function registration_middleware( Registration_Middleware $middleware ): self {
+	protected function registration_middleware(Registration_Middleware $middleware) : self
 		if ( $this->registration === null ) {
 			throw App_Initialization_Exception::requires_registration_service();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
Error: Call to protected method PinkCrab\Perique\Application\App::registration_middleware() from context 'PinkCrab\Perique\Application\App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:83
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:43
p

[Killed] Identical
Application/App.php:181:3
 	 * @throws App_Initialization_Exception Code 3
 	 */
 	public function registration_middleware( Registration_Middleware $middleware ): self {
-		if ( $this->registration === null ) {
+		if ($this->registration !== null) {
 			throw App_Initialization_Exception::requires_registration_service();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App has not defined Registration Service, this must be set before use.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:59
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:170
/shared/httpd/php/

[Killed] Throw_
Application/App.php:182:4
 	 */
 	public function registration_middleware( Registration_Middleware $middleware ): self {
 		if ( $this->registration === null ) {
-			throw App_Initialization_Exception::requires_registration_service();
+			App_Initialization_Exception::requires_registration_service();
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_registration_middleware_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_registration_middleware_exception
Failed asserting that exception of type "Error" matches expected exception "PinkCrab\Perique\Exceptions\App_Initialization_Exception". Message was: "Call to a member function push_middleware() on null" at
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:176
/shared/httpd/php/htdocs/Perqiue-Fram

[Killed] LogicalNot
Application/App.php:186:3
 		}
 
 		// Set the loader to the registration service, if defined.
-		if ( ! is_null( $this->loader ) ) {
+		if (is_null($this->loader)) {
 			$this->registration->set_loader( $this->loader );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_registration_middleware
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_registration_middleware
TypeError: Argument 1 passed to PinkCrab\Perique\Services\Registration\Registration_Service::set_loader() must be an instance of PinkCrab\Loader\Hook_Loader, null given, called in /shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php on line 174

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Registr

[Killed] MethodCallRemoval
Application/App.php:187:4
 
 		// Set the loader to the registration service, if defined.
 		if ( ! is_null( $this->loader ) ) {
-			$this->registration->set_loader( $this->loader );
+			
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
TypeError: Argument 1 passed to PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Hookable\Hookable_Mock::register() must be an instance of PinkCrab\Loader\Hook_Loader, null given, called in /shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Registration/Middleware/Hookable_Middleware.php

[Killed] MethodCallRemoval
Application/App.php:190:3
 			$this->registration->set_loader( $this->loader );
 		}
 
-		$this->registration->push_middleware( $middleware );
+		
 
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_during_factory_init
Failed asserting that an array contains Mock_Registration_Middleware_1322ad37 Object &000000002ac02183000000004f5ec308 (
    '__phpunit_originalObject' => null
    '__phpunit_returnValueGeneration' => true
    '__phpunit_invocationMocker' => null
).

/shared/httpd/php/htdocs/Perqiue-Framew

[Killed] PublicVisibility
Application/App.php:203:2
 	 * @throws App_Initialization_Exception Code 1 If DI container not registered
 	 * @throws App_Initialization_Exception Code 9 If class doesn't create as middleware.
 	 */
-	public function construct_registration_middleware( string $class_name ): self {
+	protected function construct_registration_middleware(string $class_name) : self
 		if ( self::$container === null ) {
 			throw App_Initialization_Exception::requires_di_container();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
Error: Call to protected method PinkCrab\Perique\Application\App::construct_registration_middleware() from context 'PinkCrab\Perique\Application\App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:227
/shared/httpd/php/htdocs/Perqiue-Framework

[Killed] Identical
Application/App.php:204:3
 	 * @throws App_Initialization_Exception Code 9 If class doesn't create as middleware.
 	 */
 	public function construct_registration_middleware( string $class_name ): self {
-		if ( self::$container === null ) {
+		if (self::$container !== null) {
 			throw App_Initialization_Exception::requires_di_container();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
PinkCrab\Perique\Exceptions\App_Initialization_Exception: The Application must be populated with a DI_Container before booting.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:39
/shared/httpd/php/htdocs/Perqiue-Framework/src/Applicatio

[Killed] Identical
Application/App.php:209:3
 		}
 
 		// Add to stack if finalise has not been run.
-		if ( false === self::$booted ) {
+		if (false !== self::$booted) {
 			$this->middleware_class_names[] = $class_name;
 			return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
Failed asserting that an array has the key 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:173
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:9

[Killed] FalseValue
Application/App.php:209:3
 		}
 
 		// Add to stack if finalise has not been run.
-		if ( false === self::$booted ) {
+		if (true === self::$booted) {
 			$this->middleware_class_names[] = $class_name;
 			return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
Failed asserting that an array has the key 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:173
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:9

[Killed] LogicalOr
Application/App.php:215:3
 		}
 
 		$middleware = self::$container->create( $class_name );
-		if ( ! is_object( $middleware ) || ! is_a( $middleware, Registration_Middleware::class ) ) {
+		if (!is_object($middleware) && !is_a($middleware, Registration_Middleware::class)) {
 			throw App_Initialization_Exception::invalid_registration_middleware_instance( $class_name );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string_throws_invalid_middleware_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string_throws_invalid_middleware_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:167
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:201
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:183
phpvfscomposer:///shared/httpd/php/

[Killed] LogicalNot
Application/App.php:215:3
 		}
 
 		$middleware = self::$container->create( $class_name );
-		if ( ! is_object( $middleware ) || ! is_a( $middleware, Registration_Middleware::class ) ) {
+		if (is_object($middleware) || !is_a($middleware, Registration_Middleware::class)) {
 			throw App_Initialization_Exception::invalid_registration_middleware_instance( $class_name );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string
PinkCrab\Perique\Exceptions\App_Initialization_Exception: PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware is not a valid instance of Registration_Middleware

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:128
/shared/httpd/php/htdoc

[Killed] Throw_
Application/App.php:216:4
 
 		$middleware = self::$container->create( $class_name );
 		if ( ! is_object( $middleware ) || ! is_a( $middleware, Registration_Middleware::class ) ) {
-			throw App_Initialization_Exception::invalid_registration_middleware_instance( $class_name );
+			App_Initialization_Exception::invalid_registration_middleware_instance($class_name);
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string_throws_invalid_middleware_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_registration_middleware_as_string_throws_invalid_middleware_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:167
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:201
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:183
phpvfscomposer:///shared/httpd/php/

[Killed] PublicVisibility
Application/App.php:230:2
 	 * @return self
 	 * @throws App_Initialization_Exception Code 3
 	 */
-	public function registration_classes( array $class_list ): self {
+	protected function registration_classes(array $class_list) : self
 		if ( $this->registration === null ) {
 			throw App_Initialization_Exception::requires_registration_service();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
Error: Call to protected method PinkCrab\Perique\Application\App::registration_classes() from context 'PinkCrab\Perique\Application\App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:126
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:61

[Killed] Identical
Application/App.php:231:3
 	 * @throws App_Initialization_Exception Code 3
 	 */
 	public function registration_classes( array $class_list ): self {
-		if ( $this->registration === null ) {
+		if ($this->registration !== null) {
 			throw App_Initialization_Exception::requires_registration_service();
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App has not defined Registration Service, this must be set before use.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:59
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:213
/shared/httpd/p

[Killed] MethodCallRemoval
Application/App.php:234:3
 		if ( $this->registration === null ) {
 			throw App_Initialization_Exception::requires_registration_service();
 		}
-		$this->registration->set_classes( $class_list );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
Failed asserting that an array contains 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Hookable\Hookable_Mock'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:66
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1

[Killed] PublicVisibility
Application/App.php:243:2
 	 *
 	 * @return self
 	 */
-	public function boot(): self {
+	protected function boot() : self
 
 		// Validate.
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Error: Call to protected method PinkCrab\Perique\Application\App::boot() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:95
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/p

[Killed] FalseValue
Application/App.php:247:3
 
 		// Validate.
 		$validate = new App_Validation( $this );
-		if ( $validate->validate() === false || $this->registration === null ) {
+		if ($validate->validate() === true || $this->registration === null) {
 			throw App_Initialization_Exception::failed_boot_validation(
 				$validate->errors
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : 

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:228
/shared/httpd/php/htdocs/Perqiue-Framework/te

[Killed] Identical
Application/App.php:247:3
 
 		// Validate.
 		$validate = new App_Validation( $this );
-		if ( $validate->validate() === false || $this->registration === null ) {
+		if ($validate->validate() === false || $this->registration !== null) {
 			throw App_Initialization_Exception::failed_boot_validation(
 				$validate->errors
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : 

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:228
/shared/httpd/php/htdocs/Perqiue-Framework/te
