[Killed] Throw_
Application/App.php:248:4
 		// Validate.
 		$validate = new App_Validation( $this );
 		if ( $validate->validate() === false || $this->registration === null ) {
-			throw App_Initialization_Exception::failed_boot_validation(
-				$validate->errors
-			);
+			App_Initialization_Exception::failed_boot_validation($validate->errors);
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
Failed asserting that exception of type "PinkCrab\Perique\Exceptions\App_Initialization_Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/App.php:254:3
 		}
 
 		// Process registration
-		$this->registration->set_container( self::$container );
+		
 
 		// Run the final process, where all are loaded in via
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_boot
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_boot
Failed asserting that null is an instance of interface "PinkCrab\Perique\Interfaces\DI_Container".

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:197
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Application/App.php:257:3
 		$this->registration->set_container( self::$container );
 
 		// Run the final process, where all are loaded in via
-		$this->finalise();
+		
 		self::$booted = true;
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
ArgumentCountError: Too few arguments to function PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Has_DI_Container::__construct(), 0 passed in /shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php on line 119 and exactly 1 expected

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures

[Killed] TrueValue
Application/App.php:258:3
 
 		// Run the final process, where all are loaded in via
 		$this->finalise();
-		self::$booted = true;
+		self::$booted = false;
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Failed asserting that an array is not empty.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:99
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] ProtectedVisibility
Application/App.php:268:2
 	 * @return self
 	 * @throws App_Initialization_Exception (code 9)
 	 */
-	protected function finalise(): self {
+	private function finalise() : self
 
 		// Bind self to container.

[Killed] MethodCallRemoval
Application/App.php:271:3
 	protected function finalise(): self {
 
 		// Bind self to container.
-		self::$container->addRule(
-			'*',
-			array(
-				'substitutions' => array(
-					self::class         => $this,
-					DI_Container::class => self::$container,
-					\wpdb::class        => $GLOBALS['wpdb'],
-				),
-			)
-		);
+		
 
 		self::$container->addRule(
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
ArgumentCountError: Too few arguments to function PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Has_DI_Container::__construct(), 0 passed in /shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php on line 119 and exactly 1 expected

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures

[Killed] ArrayItemRemoval
Application/App.php:273:4
 		// Bind self to container.
 		self::$container->addRule(
 			'*',
-			array(
-				'substitutions' => array(
-					self::class         => $this,
-					DI_Container::class => self::$container,
-					\wpdb::class        => $GLOBALS['wpdb'],
-				),
-			)
+			self::$container->addRule('*', array());
 		);
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
ArgumentCountError: Too few arguments to function PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Has_DI_Container::__construct(), 0 passed in /shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php on line 119 and exactly 1 expected

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures

[Killed] MethodCallRemoval
Application/App.php:282:3
 			)
 		);
 
-		self::$container->addRule(
-			App_Config::class,
-			array(
-				'constructParams' => array(
-					self::$app_config->export_settings(),
-				),
-			)
-		);
+		
 
 		// Allow the passing of DI Container via interface and method injection.
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_config_facade
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_config_facade
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/views/'

[Killed] ArrayItemRemoval
Application/App.php:284:4
 
 		self::$container->addRule(
 			App_Config::class,
-			array(
-				'constructParams' => array(
-					self::$app_config->export_settings(),
-				),
-			)
+			self::$container->addRule(App_Config::class, array());
 		);
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_config_facade
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_config_facade
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/views/'

[Killed] MethodCallRemoval
Application/App.php:292:3
 		);
 
 		// Allow the passing of DI Container via interface and method injection.
-		self::$container->addRule(
-			Inject_DI_Container::class,
-			array(
-				'call' => array(
-					array( 'set_di_container', array( self::$container ) ),
-				),
-			)
-		);
+		
 
 		// Allow the passing of Hook Loader via interface and method injection.
killedBy: PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_di_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_di_container
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_Di_Container_Injectables.php:40
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ArrayItemRemoval
Application/App.php:296:6
 			Inject_DI_Container::class,
 			array(
 				'call' => array(
-					array( 'set_di_container', array( self::$container ) ),
+					self::$container->addRule(Inject_DI_Container::class, array('call' => array(array('set_di_container', array()))));
 				),
 			)
killedBy: PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_di_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_di_container
ArgumentCountError: Too few arguments to function PinkCrab\Perique\Tests\Fixtures\DI\Inject_DI_Container_Mock::set_di_container(), 0 passed in /shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php on line 150 and exactly 1 expected

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services

[Killed] MethodCallRemoval
Application/App.php:302:3
 		);
 
 		// Allow the passing of Hook Loader via interface and method injection.
-		self::$container->addRule(
-			Inject_Hook_Loader::class,
-			array(
-				'call' => array(
-					array( 'set_hook_loader', array( $this->loader ) ),
-				),
-			)
-		);
+		
 
 		// Allow the passing of App Config via interface and method injection.
killedBy: PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_hook_loader
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_hook_loader
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_Di_Container_Injectables.php:50
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] ArrayItemRemoval
Application/App.php:305:5
 		self::$container->addRule(
 			Inject_Hook_Loader::class,
 			array(
-				'call' => array(
-					array( 'set_hook_loader', array( $this->loader ) ),
-				),
+				self::$container->addRule(Inject_Hook_Loader::class, array('call' => array()));
 			)
 		);
killedBy: PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_hook_loader
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_hook_loader
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_Di_Container_Injectables.php:50
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/App.php:312:3
 		);
 
 		// Allow the passing of App Config via interface and method injection.
-		self::$container->addRule(
-			Inject_App_Config::class,
-			array(
-				'call' => array(
-					array( 'set_app_config', array( self::$app_config ) ),
-				),
-			)
-		);
+		
 
 		// Process middleware classnames.
killedBy: PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_app_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_Di_Container_Injectables::test_inject_app_config
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_Di_Container_Injectables.php:60
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Application/App.php:322:3
 		);
 
 		// Process middleware classnames.
-		foreach ( $this->middleware_class_names as $class_name ) {
-			$middleware = self::$container->create( $class_name );
-			if ( ! is_object( $middleware ) || ! is_a( $middleware, Registration_Middleware::class ) ) {
-				throw App_Initialization_Exception::invalid_registration_middleware_instance( $class_name );
-			}
-
-			$this->registration_middleware( $middleware );
-		}
+		foreach (array() as $class_name) {
 
 		/** @hook{string, App_Config, Loader, DI_Container} */
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
Failed asserting that an array has the key 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:132
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpuni

[Killed] MethodCallRemoval
Application/App.php:328:4
 				throw App_Initialization_Exception::invalid_registration_middleware_instance( $class_name );
 			}
 
-			$this->registration_middleware( $middleware );
+			
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
Failed asserting that an array has the key 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:132
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpuni

[Survived] FunctionCallRemoval
Application/App.php:332:3
 		}
 
 		/** @hook{string, App_Config, Loader, DI_Container} */
-		do_action( Hooks::APP_INIT_PRE_BOOT, self::$app_config, $this->loader, self::$container ); // phpcs:disable WordPress.NamingConventions.ValidHookName.*
+		
 
 		// Initialise on init

[Killed] FunctionCallRemoval
Application/App.php:335:3
 		do_action( Hooks::APP_INIT_PRE_BOOT, self::$app_config, $this->loader, self::$container ); // phpcs:disable WordPress.NamingConventions.ValidHookName.*
 
 		// Initialise on init
-		add_action(
-			'init',
-			function () {
-				do_action( Hooks::APP_INIT_PRE_REGISTRATION, self::$app_config, $this->loader, self::$container );
-				$this->registration->process();
-				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
-				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
-			},
-			1
-		);
+		
 
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_all_hooks_fire_on_finalise_during_boot
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_all_hooks_fire_on_finalise_during_boot
Failed asserting that 'Pre Boot Hook' matches PCRE pattern "/Post Registration Hook/".

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] FunctionCallRemoval
Application/App.php:338:5
 		add_action(
 			'init',
 			function () {
-				do_action( Hooks::APP_INIT_PRE_REGISTRATION, self::$app_config, $this->loader, self::$container );
+				
 				$this->registration->process();
 				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );

[Killed] MethodCallRemoval
Application/App.php:339:5
 			'init',
 			function () {
 				do_action( Hooks::APP_INIT_PRE_REGISTRATION, self::$app_config, $this->loader, self::$container );
-				$this->registration->process();
+				
 				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
 				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:209
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] FunctionCallRemoval
Application/App.php:340:5
 			function () {
 				do_action( Hooks::APP_INIT_PRE_REGISTRATION, self::$app_config, $this->loader, self::$container );
 				$this->registration->process();
-				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
+				
 				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
 			},
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_all_hooks_fire_on_finalise_during_boot
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_all_hooks_fire_on_finalise_during_boot
Failed asserting that 'Pre Boot HookPre Registration Hook' matches PCRE pattern "/Post Registration Hook/".

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/App.php:341:5
 				do_action( Hooks::APP_INIT_PRE_REGISTRATION, self::$app_config, $this->loader, self::$container );
 				$this->registration->process();
 				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
-				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
+				 // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
 			},
 			1
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:209
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Survived] DecrementInteger
Application/App.php:343:4
 				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
 				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
 			},
-			1
+			}, 0);
 		);
 

[Survived] IncrementInteger
Application/App.php:343:4
 				do_action( Hooks::APP_INIT_POST_REGISTRATION, self::$app_config, $this->loader, self::$container );
 				$this->loader->register_hooks(); // @phpstan-ignore-line, if loader is not defined, exception will be thrown above
 			},
-			1
+			}, 2);
 		);
 

[Killed] PublicVisibility
Application/App.php:359:2
 	 * @return object|null
 	 * @throws App_Initialization_Exception Code 4
 	 */
-	public static function make( string $class, array $args = array() ) {
+	protected static function make(string $class, array $args = array())
 		if ( self::$booted === false ) {
 			throw App_Initialization_Exception::app_not_initialized( DI_Container::class );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
Error: Call to protected method PinkCrab\Perique\Application\App::make() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:105
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/php

[Killed] FalseValue
Application/App.php:360:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function make( string $class, array $args = array() ) {
-		if ( self::$booted === false ) {
+		if (self::$booted === true) {
 			throw App_Initialization_Exception::app_not_initialized( DI_Container::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Interfaces\DI_Container

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:287
/

[Killed] Identical
Application/App.php:360:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function make( string $class, array $args = array() ) {
-		if ( self::$booted === false ) {
+		if (self::$booted !== false) {
 			throw App_Initialization_Exception::app_not_initialized( DI_Container::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_di_container_rule_defined_at_init
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Interfaces\DI_Container

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:287
/

[Killed] Throw_
Application/App.php:361:4
 	 */
 	public static function make( string $class, array $args = array() ) {
 		if ( self::$booted === false ) {
-			throw App_Initialization_Exception::app_not_initialized( DI_Container::class );
+			App_Initialization_Exception::app_not_initialized(DI_Container::class);
 		}
 		return self::$container->create( $class, $args );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_cant_use_make_before_app_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_cant_use_make_before_app_booted
Failed asserting that exception of type "Error" matches expected exception "PinkCrab\Perique\Exceptions\App_Initialization_Exception". Message was: "Call to a member function create() on null" at
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:289
/shared/httpd/php/htdocs/Perqiue-Fram

[Killed] PublicVisibility
Application/App.php:374:2
 	 * @return mixed
 	 * @throws App_Initialization_Exception Code 4
 	 */
-	public static function config( string $key, string ...$child ) {
+	protected static function config(string $key, string ...$child)
 		if ( self::$booted === false ) {
 			throw App_Initialization_Exception::app_not_initialized( App_Config::class );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
Error: Call to protected method PinkCrab\Perique\Application\App::config() from context 'PinkCrab\Perique\Tests\Application\Test_App_Functional'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:120
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framewor

[Killed] Identical
Application/App.php:375:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function config( string $key, string ...$child ) {
-		if ( self::$booted === false ) {
+		if (self::$booted !== false) {
 			throw App_Initialization_Exception::app_not_initialized( App_Config::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Application\App_Config

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/Ap

[Killed] FalseValue
Application/App.php:375:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function config( string $key, string ...$child ) {
-		if ( self::$booted === false ) {
+		if (self::$booted === true) {
 			throw App_Initialization_Exception::app_not_initialized( App_Config::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Application\App_Config

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/Ap

[Killed] Throw_
Application/App.php:376:4
 	 */
 	public static function config( string $key, string ...$child ) {
 		if ( self::$booted === false ) {
-			throw App_Initialization_Exception::app_not_initialized( App_Config::class );
+			App_Initialization_Exception::app_not_initialized(App_Config::class);
 		}
 		return self::$app_config->{$key}( ...$child );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_cant_use_config_before_app_has_been_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_cant_use_config_before_app_has_been_booted
Failed asserting that exception of type "Error" matches expected exception "PinkCrab\Perique\Exceptions\App_Initialization_Exception". Message was: "Call to a member function version() on null" at
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:304
/shared/httpd/php/htdocs/

[Killed] PublicVisibility
Application/App.php:387:2
 	 * @return View|null
 	 * @throws App_Initialization_Exception Code 4
 	 */
-	public static function view(): ?View {
+	protected static function view() : ?View
 		if ( self::$booted === false ) {
 			throw App_Initialization_Exception::app_not_initialized( View::class );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Error: Call to protected method PinkCrab\Perique\Application\App::view() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:141
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

[Killed] FalseValue
Application/App.php:388:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function view(): ?View {
-		if ( self::$booted === false ) {
+		if (self::$booted === true) {
 			throw App_Initialization_Exception::app_not_initialized( View::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Services\View\View

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:315
/shared/httpd/php/htdoc

[Killed] Identical
Application/App.php:388:3
 	 * @throws App_Initialization_Exception Code 4
 	 */
 	public static function view(): ?View {
-		if ( self::$booted === false ) {
+		if (self::$booted !== false) {
 			throw App_Initialization_Exception::app_not_initialized( View::class );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App must be initialised before calling PinkCrab\Perique\Services\View\View

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:70
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:315
/shared/httpd/php/htdoc

[Killed] Throw_
Application/App.php:389:4
 	 */
 	public static function view(): ?View {
 		if ( self::$booted === false ) {
-			throw App_Initialization_Exception::app_not_initialized( View::class );
+			App_Initialization_Exception::app_not_initialized(View::class);
 		}
 		/** @var ?View */
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:64
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:96
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_

[Killed] PublicVisibility
Application/App.php:409:2
 	 *
 	 * @return bool
 	 */
-	public function has_app_config(): bool {
+	protected function has_app_config() : bool
 		return is_a( self::$app_config, App_Config::class );
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
Error: Call to protected method PinkCrab\Perique\Application\App::has_app_config() from context 'PinkCrab\Perique\Application\App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:157
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:96
php

[Killed] PublicVisibility
Application/App.php:419:2
 	 * @return DI_Container
 	 * @throws App_Initialization_Exception (Code 1)
 	 */
-	public function get_container(): DI_Container {
+	protected function get_container() : DI_Container
 		if ( self::$container === null ) {
 			// Throw container not set.
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_it_should_be_possible_to_pass_di_as_dependency
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_it_should_be_possible_to_pass_di_as_dependency
Error: Call to protected method PinkCrab\Perique\Application\App::get_container() from context 'PinkCrab\Perique\Tests\Application\Test_App'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:262
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpun
