[Killed] Identical
Application/App.php:420:3
 	 * @throws App_Initialization_Exception (Code 1)
 	 */
 	public function get_container(): DI_Container {
-		if ( self::$container === null ) {
+		if (self::$container !== null) {
 			// Throw container not set.
 			throw App_Initialization_Exception::requires_di_container();
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_it_should_be_possible_to_pass_di_as_dependency
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_it_should_be_possible_to_pass_di_as_dependency
PinkCrab\Perique\Exceptions\App_Initialization_Exception: The Application must be populated with a DI_Container before booting.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:39
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:344
/share

[Killed] Throw_
Application/App.php:422:4
 	public function get_container(): DI_Container {
 		if ( self::$container === null ) {
 			// Throw container not set.
-			throw App_Initialization_Exception::requires_di_container();
+			App_Initialization_Exception::requires_di_container();
 		}
 		return self::$container;
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_attempting_to_access_undefined_di_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_attempting_to_access_undefined_di_container
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:345
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:229
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/ht
