[Killed] MethodCallRemoval
Application/App_Config.php:93:3
 	 */
 	public function __construct( array $settings = array() ) {
 		$settings = $this->set_defaults( $settings );
-		$this->set_props( $settings );
+		
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Undefined index: path

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:338
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:286
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:257
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Applicat

[Killed] MethodCallRemoval
Application/App_Config.php:122:3
 		$this->post_types    = $this->filter_key_value_pair( $settings['post_types'] );
 		$this->taxonomies    = $this->filter_key_value_pair( $settings['taxonomies'] );
 
-		$this->set_meta( $settings['meta'] );
+		
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
Failed asserting that exception of type "OutOfBoundsException" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App_Config.php:132:2
 	 * @param string|null $default The default value to return if not set.
 	 * @return array<string, mixed>|string|null
 	 */
-	public function path( ?string $path = null, ?string $default = null ) {
+	protected function path(?string $path = null, ?string $default = null)
 
 		if ( is_null( $path ) ) {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_path
Error: Call to protected method PinkCrab\Perique\Application\App_Config::path() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:318
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/php

[Killed] Ternary
Application/App_Config.php:138:3
 			return $this->paths['path'];
 		}
 
-		return \array_key_exists( $path, $this->paths['path'] )
-			? trailingslashit( $this->paths['path'][ $path ] )
-			: $default;
+		return \array_key_exists($path, $this->paths['path']) ? $default : trailingslashit($this->paths['path'][$path]);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_path
Undefined index: missing

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:318
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] PublicVisibility
Application/App_Config.php:150:2
 	 * @param string|null $default The default value to return if not set.
 	 * @return array<string, mixed>|string|null
 	 */
-	public function url( ?string $url = null, ?string $default = null ) {
+	protected function url(?string $url = null, ?string $default = null)
 
 		if ( is_null( $url ) ) {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_url
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_url
Error: Call to protected method PinkCrab\Perique\Application\App_Config::url() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:324
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpun

[Killed] Ternary
Application/App_Config.php:156:3
 			return $this->paths['url'];
 		}
 
-		return \array_key_exists( $url, $this->paths['url'] )
-			? trailingslashit( $this->paths['url'][ $url ] )
-			: $default;
+		return \array_key_exists($url, $this->paths['url']) ? $default : trailingslashit($this->paths['url'][$url]);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_url
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_url
Undefined index: missing

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:133
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:324
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] PublicVisibility
Application/App_Config.php:166:2
 	 *
 	 * @return string
 	 */
-	public function rest(): string {
+	protected function rest() : string
 		return $this->namespaces['rest'];
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_rest_returns_rest_namespace
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_rest_returns_rest_namespace
Error: Call to protected method PinkCrab\Perique\Application\App_Config::rest() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:162
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpun

[Killed] PublicVisibility
Application/App_Config.php:175:2
 	 *
 	 * @return string
 	 */
-	public function cache(): string {
+	protected function cache() : string
 		return $this->namespaces['cache'];
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_cache_returns_cache_namespace
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_cache_returns_cache_namespace
Error: Call to protected method PinkCrab\Perique\Application\App_Config::cache() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:172
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/ph

[Killed] PublicVisibility
Application/App_Config.php:186:2
 	 * @param string|null $default The default value to return if not set.
 	 * @return string|null
 	 */
-	public function namespace( string $key, ?string $default = null ): ?string {
+	protected function namespace(string $key, ?string $default = null) : ?string
 		return array_key_exists( $key, $this->namespaces )
 			? $this->namespaces[ $key ] : $default;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_namespace
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_namespace
Error: Call to protected method PinkCrab\Perique\Application\App_Config::namespace() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:330
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/p

[Killed] Ternary
Application/App_Config.php:187:3
 	 * @return string|null
 	 */
 	public function namespace( string $key, ?string $default = null ): ?string {
-		return array_key_exists( $key, $this->namespaces )
-			? $this->namespaces[ $key ] : $default;
+		return array_key_exists($key, $this->namespaces) ? $default : $this->namespaces[$key];
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_namespace
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_namespace
Undefined index: missing

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:162
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:330
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] PublicVisibility
Application/App_Config.php:198:2
 	 * @param string|null $default The default value to return if not set.
 	 * @return mixed
 	 */
-	public function additional( string $key, ?string $default = null ) {
+	protected function additional(string $key, ?string $default = null)
 		return array_key_exists( $key, $this->additional )
 			? $this->additional[ $key ] : $default;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_additional
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_uses_default_for_additional
Error: Call to protected method PinkCrab\Perique\Application\App_Config::additional() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:312
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit

[Killed] Ternary
Application/App_Config.php:199:3
 	 * @return mixed
 	 */
 	public function additional( string $key, ?string $default = null ) {
-		return array_key_exists( $key, $this->additional )
-			? $this->additional[ $key ] : $default;
+		return array_key_exists($key, $this->additional) ? $default : $this->additional[$key];
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
Failed asserting that null matches expected 'test_value'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:89
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App_Config.php:208:2
 	 *
 	 * @return string
 	 */
-	public function version(): string {
+	protected function version() : string
 		return $this->plugin['version'];
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_can_use_static_config_to_access_app_config
Error: Call to protected method PinkCrab\Perique\Application\App_Config::version() from context 'PinkCrab\Perique\Application\App'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:378
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:120
p

[Killed] PublicVisibility
Application/App_Config.php:219:2
 	 * @return string
 	 * @throws OutOfBoundsException
 	 */
-	public function post_types( string $key ) {
+	protected function post_types(string $key)
 		if ( ! array_key_exists( $key, $this->post_types ) ) {
 			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined post type" );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
Failed asserting that exception of type "Error" matches expected exception "OutOfBoundsException". Message was: "Call to protected method PinkCrab\Perique\Application\App_Config::post_types() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'" at
/shared/httpd/php/htdocs/Pe

[Killed] LogicalNot
Application/App_Config.php:220:3
 	 * @throws OutOfBoundsException
 	 */
 	public function post_types( string $key ) {
-		if ( ! array_key_exists( $key, $this->post_types ) ) {
+		if (array_key_exists($key, $this->post_types)) {
 			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined post type" );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
Undefined index: inv_cpt

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:196
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:204
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERROR

[Killed] Throw_
Application/App_Config.php:221:4
 	 */
 	public function post_types( string $key ) {
 		if ( ! array_key_exists( $key, $this->post_types ) ) {
-			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined post type" );
+			new OutOfBoundsException("App Config :: \"{$key}\" is not a defined post type");
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
Undefined index: inv_cpt

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:196
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:204
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERROR

[Killed] PublicVisibility
Application/App_Config.php:235:2
 	 * @return string
 	 * @throws OutOfBoundsException
 	 */
-	public function meta( string $key, string $type = self::POST_META ): string {
+	protected function meta(string $key, string $type = self::POST_META) : string
 		// Check meta type.
 		if ( ! array_key_exists( $type, $this->meta ) ) {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_meta_with_type
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_meta_with_type
Error: Call to protected method PinkCrab\Perique\Application\App_Config::meta() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:266
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/ph

[Killed] LogicalNot
Application/App_Config.php:237:3
 	 */
 	public function meta( string $key, string $type = self::POST_META ): string {
 		// Check meta type.
-		if ( ! array_key_exists( $type, $this->meta ) ) {
+		if (array_key_exists($type, $this->meta)) {
 			throw new OutOfBoundsException( "App Config :: \"{$type}\" is not a valid meta type and cant be fetched" );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
OutOfBoundsException: App Config :: "term" is not a valid meta type and cant be fetched

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:210
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:249
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.

[Killed] Throw_
Application/App_Config.php:238:4
 	public function meta( string $key, string $type = self::POST_META ): string {
 		// Check meta type.
 		if ( ! array_key_exists( $type, $this->meta ) ) {
-			throw new OutOfBoundsException( "App Config :: \"{$type}\" is not a valid meta type and cant be fetched" );
+			new OutOfBoundsException("App Config :: \"{$type}\" is not a valid meta type and cant be fetched");
 		}
 		// Check key.
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_calling_invalid_meta_type
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_calling_invalid_meta_type
Undefined index: invalid_type

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:213
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:251
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERROR

[Killed] LogicalNot
Application/App_Config.php:241:3
 			throw new OutOfBoundsException( "App Config :: \"{$type}\" is not a valid meta type and cant be fetched" );
 		}
 		// Check key.
-		if ( ! array_key_exists( $key, $this->meta[ $type ] ) ) {
+		if (array_key_exists($key, $this->meta[$type])) {
 			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined {$type} meta key" );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
OutOfBoundsException: App Config :: "term_meta_1" is not a defined term meta key

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:214
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:249
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:286

[Killed] Throw_
Application/App_Config.php:242:4
 		}
 		// Check key.
 		if ( ! array_key_exists( $key, $this->meta[ $type ] ) ) {
-			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined {$type} meta key" );
+			new OutOfBoundsException("App Config :: \"{$key}\" is not a defined {$type} meta key");
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_unset_meta_key
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_unset_meta_key
Undefined index: invalid_key

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:216
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:260
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] PublicVisibility
Application/App_Config.php:255:2
 	 * @param string $key
 	 * @return string
 	 */
-	public function post_meta( string $key ): string {
+	protected function post_meta(string $key) : string
 		return $this->meta( $key, self::POST_META );
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_post_meta
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_post_meta
Error: Call to protected method PinkCrab\Perique\Application\App_Config::post_meta() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:274
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/ph

[Killed] PublicVisibility
Application/App_Config.php:266:2
 	 * @param string $key
 	 * @return string
 	 */
-	public function user_meta( string $key ): string {
+	protected function user_meta(string $key) : string
 		return $this->meta( $key, self::USER_META );
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_user_meta
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_user_meta
Error: Call to protected method PinkCrab\Perique\Application\App_Config::user_meta() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:280
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/ph

[Killed] PublicVisibility
Application/App_Config.php:277:2
 	 * @param string $key
 	 * @return string
 	 */
-	public function term_meta( string $key ): string {
+	protected function term_meta(string $key) : string
 		return $this->meta( $key, self::TERM_META );
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_term_meta
Error: Call to protected method PinkCrab\Perique\Application\App_Config::term_meta() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:286
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/ph

[Survived] PublicVisibility
Application/App_Config.php:287:2
 	 * @param array<string, array<string,string>> $meta
 	 * @return void
 	 */
-	public function set_meta( array $meta ): void {
+	protected function set_meta(array $meta) : void
 		$valid_meta_types = array( self::POST_META, self::USER_META, self::TERM_META );
 		foreach ( $meta as $meta_type => $pairs ) {

[Killed] ArrayItemRemoval
Application/App_Config.php:288:3
 	 * @return void
 	 */
 	public function set_meta( array $meta ): void {
-		$valid_meta_types = array( self::POST_META, self::USER_META, self::TERM_META );
+		$valid_meta_types = array(self::USER_META, self::TERM_META);
 		foreach ( $meta as $meta_type => $pairs ) {
 			if ( ! in_array( $meta_type, $valid_meta_types, true ) ) {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
OutOfBoundsException: App Config :: "post" is not a valid meta type and cant be defined

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:262
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:105
/shared/httpd/php/htdocs/Perqiue-Framework/src/Applica

[Killed] Foreach_
Application/App_Config.php:289:3
 	 */
 	public function set_meta( array $meta ): void {
 		$valid_meta_types = array( self::POST_META, self::USER_META, self::TERM_META );
-		foreach ( $meta as $meta_type => $pairs ) {
-			if ( ! in_array( $meta_type, $valid_meta_types, true ) ) {
-				throw new OutOfBoundsException( "App Config :: \"{$meta_type}\" is not a valid meta type and cant be defined" );
-			}
-
-			// Set all pairs which have both valid key and values.
-			$this->meta[ $meta_type ] = $this->filter_key_value_pair( $pairs );
-		}
+		foreach (array() as $meta_type => $pairs) {
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
Failed asserting that exception of type "OutOfBoundsException" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] LogicalNot
Application/App_Config.php:290:4
 	public function set_meta( array $meta ): void {
 		$valid_meta_types = array( self::POST_META, self::USER_META, self::TERM_META );
 		foreach ( $meta as $meta_type => $pairs ) {
-			if ( ! in_array( $meta_type, $valid_meta_types, true ) ) {
+			if (in_array($meta_type, $valid_meta_types, true)) {
 				throw new OutOfBoundsException( "App Config :: \"{$meta_type}\" is not a valid meta type and cant be defined" );
 			}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_can_validate_with_all_services_bound
OutOfBoundsException: App Config :: "post" is not a valid meta type and cant be defined

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:262
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:105
/shared/httpd/php/htdocs/Perqiue-Framework/src/Applica

[Killed] Throw_
Application/App_Config.php:291:5
 		$valid_meta_types = array( self::POST_META, self::USER_META, self::TERM_META );
 		foreach ( $meta as $meta_type => $pairs ) {
 			if ( ! in_array( $meta_type, $valid_meta_types, true ) ) {
-				throw new OutOfBoundsException( "App Config :: \"{$meta_type}\" is not a valid meta type and cant be defined" );
+				new OutOfBoundsException("App Config :: \"{$meta_type}\" is not a valid meta type and cant be defined");
 			}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_setting_invalid_meta_type_key
Failed asserting that exception of type "OutOfBoundsException" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] PublicVisibility
Application/App_Config.php:306:2
 	 * @return string
 	 * @throws OutOfBoundsException
 	 */
-	public function taxonomies( string $key ): string {
+	protected function taxonomies(string $key) : string
 		if ( ! array_key_exists( $key, $this->taxonomies ) ) {
 			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined taxonomy" );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_taxonomy_slug
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_taxonomy_slug
Error: Call to protected method PinkCrab\Perique\Application\App_Config::taxonomies() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:225
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpun

[Killed] LogicalNot
Application/App_Config.php:307:3
 	 * @throws OutOfBoundsException
 	 */
 	public function taxonomies( string $key ): string {
-		if ( ! array_key_exists( $key, $this->taxonomies ) ) {
+		if (array_key_exists($key, $this->taxonomies)) {
 			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined taxonomy" );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_taxonomy_slug
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_taxonomy_slug
OutOfBoundsException: App Config :: "tax" is not a defined taxonomy

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:278
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:225
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/php

[Killed] Throw_
Application/App_Config.php:308:4
 	 */
 	public function taxonomies( string $key ): string {
 		if ( ! array_key_exists( $key, $this->taxonomies ) ) {
-			throw new OutOfBoundsException( "App Config :: \"{$key}\" is not a defined taxonomy" );
+			new OutOfBoundsException("App Config :: \"{$key}\" is not a defined taxonomy");
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_unset_taxonomy_key
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_exception_throw_for_unset_taxonomy_key
Undefined index: invalid

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:280
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:219
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] PublicVisibility
Application/App_Config.php:322:2
 	 * @return string
 	 * @throws OutOfBoundsException
 	 */
-	public function db_tables( string $name ): string {
+	protected function db_tables(string $name) : string
 		if ( ! array_key_exists( $name, $this->db_tables ) ) {
 			throw new OutOfBoundsException( "App Config :: \"{$name}\" is not a defined DB table" );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
Failed asserting that exception of type "Error" matches expected exception "OutOfBoundsException". Message was: "Call to protected method PinkCrab\Perique\Application\App_Config::db_tables() from context 'PinkCrab\Perique\Tests\Application\Test_App_Config'" at
/shared/httpd/php/htdocs/Perqiue-Framework/

[Killed] LogicalNot
Application/App_Config.php:323:3
 	 * @throws OutOfBoundsException
 	 */
 	public function db_tables( string $name ): string {
-		if ( ! array_key_exists( $name, $this->db_tables ) ) {
+		if (array_key_exists($name, $this->db_tables)) {
 			throw new OutOfBoundsException( "App Config :: \"{$name}\" is not a defined DB table" );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
Undefined index: failure

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:294
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:306
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Killed] Throw_
Application/App_Config.php:324:4
 	 */
 	public function db_tables( string $name ): string {
 		if ( ! array_key_exists( $name, $this->db_tables ) ) {
-			throw new OutOfBoundsException( "App Config :: \"{$name}\" is not a defined DB table" );
+			new OutOfBoundsException("App Config :: \"{$name}\" is not a defined DB table");
 		}
 		return $this->db_tables[ $name ];
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_throws_exception_for_unset_db_table
Undefined index: failure

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:294
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:306
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!

[Survived] DecrementInteger
Application/App_Config.php:345:3
 	 * @return array<string, mixed>
 	 */
 	private function settings_defaults(): array {
-		$base_path  = \dirname( __DIR__, 2 );
+		$base_path = \dirname(__DIR__, 1);
 		$plugin_dir = \basename( $base_path );
 		$wp_uploads = \wp_upload_dir();
