[Survived] IncrementInteger
Application/App_Config.php:345:3
 	 * @return array<string, mixed>
 	 */
 	private function settings_defaults(): array {
-		$base_path  = \dirname( __DIR__, 2 );
+		$base_path = \dirname(__DIR__, 3);
 		$plugin_dir = \basename( $base_path );
 		$wp_uploads = \wp_upload_dir();

[Killed] LogicalAnd
Application/App_Config.php:394:5
 		return array_filter(
 			$pairs,
 			function ( $value, $key ): bool {
-				return is_string( $value )
-				&& \mb_strlen( $value ) > 0
+				return (is_string($value) || \mb_strlen($value) > 0) && is_string($key);0
 				&& is_string( $key );
 			},
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
Failed asserting that exception of type "TypeError" matches expected exception "OutOfBoundsException". Message was: "mb_strlen() expects parameter 1 to be string, array given" at
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:328
/shared/httpd/php/htdocs/Perqiue

[Killed] LogicalAnd
Application/App_Config.php:394:5
 		return array_filter(
 			$pairs,
 			function ( $value, $key ): bool {
-				return is_string( $value )
-				&& \mb_strlen( $value ) > 0
-				&& is_string( $key );
+				return is_string($value) && \mb_strlen($value) > 0 || is_string($key);
 			},
 			ARRAY_FILTER_USE_BOTH
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_filters_post_type_with_none_string_key_value_pairs
Failed asserting that exception of type "OutOfBoundsException" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] GreaterThanNegotiation
Application/App_Config.php:395:5
 			$pairs,
 			function ( $value, $key ): bool {
 				return is_string( $value )
-				&& \mb_strlen( $value ) > 0
+				return is_string($value) && \mb_strlen($value) <= 0 && is_string($key);
 				&& is_string( $key );
 			},
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_db_table_name
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_get_db_table_name
OutOfBoundsException: App Config :: "db" is not a defined DB table

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Config.php:292
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:294
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpu

[Survived] GreaterThan
Application/App_Config.php:395:5
 			$pairs,
 			function ( $value, $key ): bool {
 				return is_string( $value )
-				&& \mb_strlen( $value ) > 0
+				return is_string($value) && \mb_strlen($value) >= 0 && is_string($key);
 				&& is_string( $key );
 			},

[Killed] PublicVisibility
Application/App_Config.php:407:2
 	 *
 	 * @return array<string, string|int|array<mixed>>
 	 */
-	public function export_settings(): array {
+	protected function export_settings() : array
 		return array(
 			'path'       => $this->paths['path'],
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Error: Call to protected method PinkCrab\Perique\Application\App_Config::export_settings() from context 'PinkCrab\Perique\Application\App'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:286
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:257
/shared/httpd/php/
