[Killed] Identical
Application/App_Factory.php:46:3
 	public function __construct( ?string $base_path = null ) {
 		$this->app = new App();
 
-		if ( null === $base_path ) {
+		if (null !== $base_path) {
 			$file_index      = 0;
 			$trace           = debug_backtrace(); //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/'
+'/'

[Killed] DecrementInteger
Application/App_Factory.php:47:4
 		$this->app = new App();
 
 		if ( null === $base_path ) {
-			$file_index      = 0;
+			$file_index = -1;
 			$trace           = debug_backtrace(); //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
 			$this->base_path = isset( $trace[ $file_index ]['file'] ) ? \trailingslashit( dirname( $trace[ $file_index ]['file'] ) ) : __DIR__;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/'

[Killed] Ternary
Application/App_Factory.php:49:4
 		if ( null === $base_path ) {
 			$file_index      = 0;
 			$trace           = debug_backtrace(); //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
-			$this->base_path = isset( $trace[ $file_index ]['file'] ) ? \trailingslashit( dirname( $trace[ $file_index ]['file'] ) ) : __DIR__;
+			$this->base_path = isset($trace[$file_index]['file']) ? __DIR__ : \trailingslashit(dirname($trace[$file_index]['file']));
 		} else {
 			$this->base_path = \trailingslashit( $base_path );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/'

[Killed] PublicVisibility
Application/App_Factory.php:65:2
 	 *
 	 * @return self
 	 */
-	public function with_wp_dice( bool $include_default_rules = false ): self {
+	protected function with_wp_dice(bool $include_default_rules = false) : self
 		$loader = new Hook_Loader();
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
Error: Call to protected method PinkCrab\Perique\Application\App_Factory::with_wp_dice() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:43
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpu

[Survived] FalseValue
Application/App_Factory.php:65:2
 	 *
 	 * @return self
 	 */
-	public function with_wp_dice( bool $include_default_rules = false ): self {
+	public function with_wp_dice(bool $include_default_rules = true) : self
 		$loader = new Hook_Loader();
 

[Killed] Identical
Application/App_Factory.php:71:3
 		// Setup DI Container
 		$container = PinkCrab_Dice::withDice( new Dice() );
 
-		if ( $include_default_rules === true ) {
+		if ($include_default_rules !== true) {
 			$container->addRules( $this->default_di_rules() );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:64
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:96
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:129
/shared/httpd/

[Killed] TrueValue
Application/App_Factory.php:71:3
 		// Setup DI Container
 		$container = PinkCrab_Dice::withDice( new Dice() );
 
-		if ( $include_default_rules === true ) {
+		if ($include_default_rules === false) {
 			$container->addRules( $this->default_di_rules() );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:64
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:96
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:129
/shared/httpd/

[Killed] MethodCallRemoval
Application/App_Factory.php:72:4
 		$container = PinkCrab_Dice::withDice( new Dice() );
 
 		if ( $include_default_rules === true ) {
-			$container->addRules( $this->default_di_rules() );
+			
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:64
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:96
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:129
/shared/httpd/

[Killed] MethodCallRemoval
Application/App_Factory.php:75:3
 			$container->addRules( $this->default_di_rules() );
 		}
 
-		$this->app->set_container( $container );
+		
 
 		// Set registration middleware
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
Failed asserting that null is an instance of interface "PinkCrab\Perique\Interfaces\DI_Container".

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:49
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2

[Killed] MethodCallRemoval
Application/App_Factory.php:78:3
 		$this->app->set_container( $container );
 
 		// Set registration middleware
-		$this->app->set_registration_services( new Registration_Service() );
+		
 
 		$this->app->set_loader( $loader );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App has not defined Registration Service, this must be set before use.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:59
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:182
/shared/httpd/php/

[Killed] MethodCallRemoval
Application/App_Factory.php:80:3
 		// Set registration middleware
 		$this->app->set_registration_services( new Registration_Service() );
 
-		$this->app->set_loader( $loader );
+		
 
 		// Include Hookable.
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
Failed asserting that null is an instance of class "PinkCrab\Loader\Hook_Loader".

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:53
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.

[Killed] MethodCallRemoval
Application/App_Factory.php:83:3
 		$this->app->set_loader( $loader );
 
 		// Include Hookable.
-		$this->app->registration_middleware( new Hookable_Middleware() );
+		
 
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Functional.php:209
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 21, Assertions: 32, Failures: 1.

[Survived] ProtectedVisibility
Application/App_Factory.php:94:2
 	 *
 	 * @return array<mixed>
 	 */
-	protected function default_di_rules(): array {
+	private function default_di_rules() : array
 		return array(
 			'*' => array(

[Killed] ArrayItemRemoval
Application/App_Factory.php:97:5
 	protected function default_di_rules(): array {
 		return array(
 			'*' => array(
-				'substitutions' => array(
-					Renderable::class => new PHP_Engine( $this->base_path ),
-				),
+				return array('*' => array('substitutions' => array()));
 			),
 		);
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:64
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:119
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:96
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:129
/shared/httpd/

[Killed] PublicVisibility
Application/App_Factory.php:110:2
 	 * @param array<string,array<string,string|object|callable|null|false|\Closure>> $rules
 	 * @return self
 	 */
-	public function di_rules( array $rules ): self {
+	protected function di_rules(array $rules) : self
 		$this->app->container_config(
 			function( DI_Container $container ) use ( $rules ): void {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
Error: Call to protected method PinkCrab\Perique\Application\App_Factory::di_rules() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:74
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/ph

[Killed] MethodCallRemoval
Application/App_Factory.php:111:3
 	 * @return self
 	 */
 	public function di_rules( array $rules ): self {
-		$this->app->container_config(
-			function( DI_Container $container ) use ( $rules ): void {
-				$container->addRules( $rules );
-			}
-		);
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:78
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/App_Factory.php:113:5
 	public function di_rules( array $rules ): self {
 		$this->app->container_config(
 			function( DI_Container $container ) use ( $rules ): void {
-				$container->addRules( $rules );
+				
 			}
 		);
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_di_rule
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:78
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 3, Assertions: 5, Failures: 1.

[Killed] MethodCallRemoval
Application/App_Factory.php:126:3
 	 * @return self
 	 */
 	public function registration_classes( array $class_list ): self {
-		$this->app->registration_classes( $class_list );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_registration_classes
Failed asserting that an array contains 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Hookable\Hookable_Mock'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:66
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 2

[Killed] PublicVisibility
Application/App_Factory.php:136:2
 	 * @param array<string, mixed> $app_config
 	 * @return self
 	 */
-	public function app_config( array $app_config ): self {
+	protected function app_config(array $app_config) : self
 		$this->app->set_app_config( array_merge( $this->default_config_paths(), $app_config ) );
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
Error: Call to protected method PinkCrab\Perique\Application\App_Factory::app_config() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:85
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/p

[Killed] MethodCallRemoval
Application/App_Factory.php:137:3
 	 * @return self
 	 */
 	public function app_config( array $app_config ): self {
-		$this->app->set_app_config( array_merge( $this->default_config_paths(), $app_config ) );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_set_config
Trying to get property 'test_key' of non-object

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:89
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 4, Assertions: 5, Errors: 1.

[Killed] PublicVisibility
Application/App_Factory.php:146:2
 	 *
 	 * @return \PinkCrab\Perique\Application\App
 	 */
-	public function app(): App {
+	protected function app() : App
 		return $this->app;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_create_with_wp_dicece
Error: Call to protected method PinkCrab\Perique\Application\App_Factory::app() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:44
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpun

[Killed] PublicVisibility
Application/App_Factory.php:155:2
 	 *
 	 * @return \PinkCrab\Perique\Application\App
 	 */
-	public function boot(): App {
+	protected function boot() : App
 		// Sets default settings if not already set.
 		if ( ! $this->app->has_app_config() ) {
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
Error: Call to protected method PinkCrab\Perique\Application\App_Factory::boot() from context 'PinkCrab\Perique\Tests\Application\Test_App_Factory'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:96
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpuni

[Killed] LogicalNot
Application/App_Factory.php:157:3
 	 */
 	public function boot(): App {
 		// Sets default settings if not already set.
-		if ( ! $this->app->has_app_config() ) {
+		if ($this->app->has_app_config()) {
 			$this->app_config( $this->default_config_paths() );
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : app_config was not set in App

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:249
/shared/httpd/php/htdoc

[Killed] MethodCallRemoval
Application/App_Factory.php:158:4
 	public function boot(): App {
 		// Sets default settings if not already set.
 		if ( ! $this->app->has_app_config() ) {
-			$this->app_config( $this->default_config_paths() );
+			
 		}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_can_boot_app_from_factory_chain
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : app_config was not set in App

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:249
/shared/httpd/php/htdoc

[Killed] MethodCallRemoval
Application/App_Factory.php:213:3
 	 * @throws App_Initialization_Exception Code 3
 	 */
 	public function registration_middleware( Registration_Middleware $middleware ): self {
-		$this->app->registration_middleware( $middleware );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_during_factory_init
Failed asserting that an array contains Mock_Registration_Middleware_67151f6b Object &000000003b8baa64000000002ef19e0c (
    '__phpunit_originalObject' => null
    '__phpunit_returnValueGeneration' => true
    '__phpunit_invocationMocker' => null
).

/shared/httpd/php/htdocs/Perqiue-Framew

[Killed] MethodCallRemoval
Application/App_Factory.php:227:3
 	 * @throws App_Initialization_Exception Code 9 If class doesn't create as middleware.
 	 */
 	public function construct_registration_middleware( string $class_name ): self {
-		$this->app->construct_registration_middleware( $class_name );
+		
 		return $this;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_pass_registration_middleware_as_string_during_factory_init
Failed asserting that an array has the key 'PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Mock_Registration_Middleware'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Factory.php:132
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpuni
