[Killed] PublicVisibility
Application/App_Validation.php:55:2
 	 *
 	 * @return bool
 	 */
-	public function validate(): bool {
+	protected function validate() : bool
 		$this->already_booted();
 		$this->validate_properties_set();
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
Error: Call to protected method PinkCrab\Perique\Application\App_Validation::validate() from context 'PinkCrab\Perique\Tests\Application\Test_App_Validation'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:37
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Fra

[Killed] MethodCallRemoval
Application/App_Validation.php:56:3
 	 * @return bool
 	 */
 	public function validate(): bool {
-		$this->already_booted();
+		
 		$this->validate_properties_set();
 		return count( $this->errors ) === 0;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Failed asserting that an array is not empty.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:99
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Application/App_Validation.php:57:3
 	 */
 	public function validate(): bool {
 		$this->already_booted();
-		$this->validate_properties_set();
+		
 		return count( $this->errors ) === 0;
 	}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
Failed asserting that an array is not empty.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:38
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Identical
Application/App_Validation.php:58:3
 	public function validate(): bool {
 		$this->already_booted();
 		$this->validate_properties_set();
-		return count( $this->errors ) === 0;
+		return count($this->errors) !== 0;
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : 

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:249
/shared/httpd/php/htdocs/Perqiue-Framework/te

[Survived] ProtectedVisibility
Application/App_Validation.php:67:2
 	 *
 	 * @return void
 	 */
-	protected function validate_properties_set(): void {
+	private function validate_properties_set() : void
 		foreach ( $this->required_properties as $property => $is_static ) {
 			$property_reflection = new ReflectionProperty( $this->app, $property );

[Killed] Foreach_
Application/App_Validation.php:68:3
 	 * @return void
 	 */
 	protected function validate_properties_set(): void {
-		foreach ( $this->required_properties as $property => $is_static ) {
-			$property_reflection = new ReflectionProperty( $this->app, $property );
-			$property_reflection->setAccessible( true );
-			if ( empty( $property_reflection->getValue( $this->app ) ) ) {
-				$this->errors[] = \sprintf( self::ERROR_MESSAGE_TEMPLATE, $property );
-			}
-		}
+		foreach (array() as $property => $is_static) {
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
Failed asserting that an array is not empty.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Validation.php:38
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Application/App_Validation.php:70:4
 	protected function validate_properties_set(): void {
 		foreach ( $this->required_properties as $property => $is_static ) {
 			$property_reflection = new ReflectionProperty( $this->app, $property );
-			$property_reflection->setAccessible( true );
+			$property_reflection->setAccessible(false);
 			if ( empty( $property_reflection->getValue( $this->app ) ) ) {
 				$this->errors[] = \sprintf( self::ERROR_MESSAGE_TEMPLATE, $property );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
ReflectionException: Cannot access non-public member PinkCrab\Perique\Application\App::$container

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:61
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:47
/shared/httpd/php/htdocs/Perqiue-Framew

[Killed] MethodCallRemoval
Application/App_Validation.php:70:4
 	protected function validate_properties_set(): void {
 		foreach ( $this->required_properties as $property => $is_static ) {
 			$property_reflection = new ReflectionProperty( $this->app, $property );
-			$property_reflection->setAccessible( true );
+			
 			if ( empty( $property_reflection->getValue( $this->app ) ) ) {
 				$this->errors[] = \sprintf( self::ERROR_MESSAGE_TEMPLATE, $property );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_validation_failed_with_no_container
ReflectionException: Cannot access non-public member PinkCrab\Perique\Application\App::$container

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:61
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Validation.php:47
/shared/httpd/php/htdocs/Perqiue-Framew

[Survived] ProtectedVisibility
Application/App_Validation.php:82:2
 	 *
 	 * @return void
 	 */
-	protected function already_booted(): void {
+	private function already_booted() : void
 		if ( $this->app->is_booted() === true ) {
 			$this->errors[] = self::ERROR_MESSAGE_APP_BOOTED;

[Killed] Identical
Application/App_Validation.php:83:3
 	 * @return void
 	 */
 	protected function already_booted(): void {
-		if ( $this->app->is_booted() === true ) {
+		if ($this->app->is_booted() !== true) {
 			$this->errors[] = self::ERROR_MESSAGE_APP_BOOTED;
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : App already booted

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:249
/shared/httpd/php/htdocs/Pe

[Killed] TrueValue
Application/App_Validation.php:83:3
 	 * @return void
 	 */
 	protected function already_booted(): void {
-		if ( $this->app->is_booted() === true ) {
+		if ($this->app->is_booted() === false) {
 			$this->errors[] = self::ERROR_MESSAGE_APP_BOOTED;
 		}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
PinkCrab\Perique\Exceptions\App_Initialization_Exception: App failed boot validation : App already booted

/shared/httpd/php/htdocs/Perqiue-Framework/src/Exceptions/App_Initialization_Exception.php:104
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:249
/shared/httpd/php/htdocs/Pe
