[Killed] LogicalNot
Application/Config.php:38:3
 	 * @return mixed
 	 */
 	public static function __callStatic( $method, $params ) {
-		if ( ! self::$config_cache ) {
+		if (self::$config_cache) {
 			/** @phpstan-ignore-next-line */
 			self::$config_cache = App::make( App_Config::class );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_call_with_config_proxy
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Config::test_can_call_with_config_proxy
Error: Call to a member function namespace() on null

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/Config.php:38
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_Config.php:76
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
