[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:37:2
 	 * @code 1
 	 * @return App_Initialization_Exception
 	 */
-	public static function requires_di_container(): App_Initialization_Exception {
+	protected static function requires_di_container() : App_Initialization_Exception
 		$message = 'The Application must be populated with a DI_Container before booting.';
 		return new App_Initialization_Exception( $message, 1 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:205
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:246
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///sha

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:39:3
 	 */
 	public static function requires_di_container(): App_Initialization_Exception {
 		$message = 'The Application must be populated with a DI_Container before booting.';
-		return new App_Initialization_Exception( $message, 1 );
+		return new App_Initialization_Exception($message, 2);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
Failed asserting that 2 is equal to expected exception code 1.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:39:3
 	 */
 	public static function requires_di_container(): App_Initialization_Exception {
 		$message = 'The Application must be populated with a DI_Container before booting.';
-		return new App_Initialization_Exception( $message, 1 );
+		return new App_Initialization_Exception($message, 0);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_construct_middleware_before_container_initialised
Failed asserting that 0 is equal to expected exception code 1.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:47:2
 	 * @code 2
 	 * @return App_Initialization_Exception
 	 */
-	public static function di_container_exists(): App_Initialization_Exception {
+	protected static function di_container_exists() : App_Initialization_Exception
 		$message = 'App already contains a DI Container, can not redeclare.';
 		return new App_Initialization_Exception( $message, 2 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:106
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:61
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/php

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:49:3
 	 */
 	public static function di_container_exists(): App_Initialization_Exception {
 		$message = 'App already contains a DI Container, can not redeclare.';
-		return new App_Initialization_Exception( $message, 2 );
+		return new App_Initialization_Exception($message, 3);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
Failed asserting that 3 is equal to expected exception code 2.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:49:3
 	 */
 	public static function di_container_exists(): App_Initialization_Exception {
 		$message = 'App already contains a DI Container, can not redeclare.';
-		return new App_Initialization_Exception( $message, 2 );
+		return new App_Initialization_Exception($message, 1);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_container_exception
Failed asserting that 1 is equal to expected exception code 2.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:57:2
 	 * @code 3
 	 * @return App_Initialization_Exception
 	 */
-	public static function requires_registration_service(): App_Initialization_Exception {
+	protected static function requires_registration_service() : App_Initialization_Exception
 		$message = 'App has not defined Registration Service, this must be set before use.';
 		return new App_Initialization_Exception( $message, 3 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:232
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:180
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/php

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:59:3
 	 */
 	public static function requires_registration_service(): App_Initialization_Exception {
 		$message = 'App has not defined Registration Service, this must be set before use.';
-		return new App_Initialization_Exception( $message, 3 );
+		return new App_Initialization_Exception($message, 2);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
Failed asserting that 2 is equal to expected exception code 3.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:59:3
 	 */
 	public static function requires_registration_service(): App_Initialization_Exception {
 		$message = 'App has not defined Registration Service, this must be set before use.';
-		return new App_Initialization_Exception( $message, 3 );
+		return new App_Initialization_Exception($message, 4);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_registration_classes_exception
Failed asserting that 4 is equal to expected exception code 3.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:68:2
 	 * @param string $service The service which has been called without initialising the app.
 	 * @return App_Initialization_Exception
 	 */
-	public static function app_not_initialized( string $service ): App_Initialization_Exception {
+	protected static function app_not_initialized(string $service) : App_Initialization_Exception
 		$message = "App must be initialised before calling {$service}";
 		return new App_Initialization_Exception( $message, 4 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:389
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:215
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiu

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:70:3
 	 */
 	public static function app_not_initialized( string $service ): App_Initialization_Exception {
 		$message = "App must be initialised before calling {$service}";
-		return new App_Initialization_Exception( $message, 4 );
+		return new App_Initialization_Exception($message, 5);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
Failed asserting that 5 is equal to expected exception code 4.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:70:3
 	 */
 	public static function app_not_initialized( string $service ): App_Initialization_Exception {
 		$message = "App must be initialised before calling {$service}";
-		return new App_Initialization_Exception( $message, 4 );
+		return new App_Initialization_Exception($message, 3);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_view_is_called_before_app_booted
Failed asserting that 3 is equal to expected exception code 4.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:78:2
 	 * @code 5
 	 * @return App_Initialization_Exception
 	 */
-	public static function app_config_exists(): App_Initialization_Exception {
+	protected static function app_config_exists() : App_Initialization_Exception
 		$message = 'Can not redeclare App_Config as its already set to the application';
 		return new App_Initialization_Exception( $message, 5 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:122
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:78
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/ph

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:80:3
 	 */
 	public static function app_config_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare App_Config as its already set to the application';
-		return new App_Initialization_Exception( $message, 5 );
+		return new App_Initialization_Exception($message, 6);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
Failed asserting that 6 is equal to expected exception code 5.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:80:3
 	 */
 	public static function app_config_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare App_Config as its already set to the application';
-		return new App_Initialization_Exception( $message, 5 );
+		return new App_Initialization_Exception($message, 4);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_app_config_exception
Failed asserting that 4 is equal to expected exception code 5.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:88:2
 	 * @code 7
 	 * @return App_Initialization_Exception
 	 */
-	public static function registration_exists(): App_Initialization_Exception {
+	protected static function registration_exists() : App_Initialization_Exception
 		$message = 'Can not redeclare Registration_Service as its already set to the application';
 		return new App_Initialization_Exception( $message, 7 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:137
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:97
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:90:3
 	 */
 	public static function registration_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare Registration_Service as its already set to the application';
-		return new App_Initialization_Exception( $message, 7 );
+		return new App_Initialization_Exception($message, 8);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
Failed asserting that 8 is equal to expected exception code 7.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:90:3
 	 */
 	public static function registration_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare Registration_Service as its already set to the application';
-		return new App_Initialization_Exception( $message, 7 );
+		return new App_Initialization_Exception($message, 6);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_registration_services_exception
Failed asserting that 6 is equal to expected exception code 7.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:99:2
 	 * @param array<int,string> $errors
 	 * @return App_Initialization_Exception
 	 */
-	public static function failed_boot_validation( array $errors ): App_Initialization_Exception {
+	protected static function failed_boot_validation(array $errors) : App_Initialization_Exception
 		$message = sprintf(
 			'App failed boot validation : %s',
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:248
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:207
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97
.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:104:3
 			'App failed boot validation : %s',
 			join( ',', $errors )
 		);
-		return new App_Initialization_Exception( $message, 6 );
+		return new App_Initialization_Exception($message, 7);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
Failed asserting that 7 is equal to expected exception code 6.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:104:3
 			'App failed boot validation : %s',
 			join( ',', $errors )
 		);
-		return new App_Initialization_Exception( $message, 6 );
+		return new App_Initialization_Exception($message, 5);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_throws_exception_if_trying_to_boot_twice
Failed asserting that 5 is equal to expected exception code 6.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:112:2
 	 * @code 8
 	 * @return App_Initialization_Exception
 	 */
-	public static function loader_exists(): App_Initialization_Exception {
+	protected static function loader_exists() : App_Initialization_Exception
 		$message = 'Can not redeclare Loader as its already set to the application';
 		return new App_Initialization_Exception( $message, 8 );
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
Failed asserting that exception of type "Error" matches expected exception "PinkCrab\Perique\Exceptions\App_Initialization_Exception". Message was: "Call to protected method PinkCrab\Perique\Exceptions\App_Initialization_Exception::loader_exists() from context 'PinkCrab\Perique\Application\App'" at
/shared/httpd/php/htdocs/P

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:114:3
 	 */
 	public static function loader_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare Loader as its already set to the application';
-		return new App_Initialization_Exception( $message, 8 );
+		return new App_Initialization_Exception($message, 7);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
Failed asserting that 7 is equal to expected exception code 8.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:114:3
 	 */
 	public static function loader_exists(): App_Initialization_Exception {
 		$message = 'Can not redeclare Loader as its already set to the application';
-		return new App_Initialization_Exception( $message, 8 );
+		return new App_Initialization_Exception($message, 9);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_set_loader_exception
Failed asserting that 9 is equal to expected exception code 8.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] PublicVisibility
Exceptions/App_Initialization_Exception.php:123:2
 	 * @param string $class
 	 * @return App_Initialization_Exception
 	 */
-	public static function invalid_registration_middleware_instance( string $class ): App_Initialization_Exception {
+	protected static function invalid_registration_middleware_instance(string $class) : App_Initialization_Exception
 		$message = sprintf(
 			'%s is not a valid instance of Registration_Middleware',
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:325
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:257
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App.php:255
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpuni

[Killed] IncrementInteger
Exceptions/App_Initialization_Exception.php:128:3
 			'%s is not a valid instance of Registration_Middleware',
 			$class
 		);
-		return new App_Initialization_Exception( $message, 9 );
+		return new App_Initialization_Exception($message, 10);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
Failed asserting that 10 is equal to expected exception code 9.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] DecrementInteger
Exceptions/App_Initialization_Exception.php:128:3
 			'%s is not a valid instance of Registration_Middleware',
 			$class
 		);
-		return new App_Initialization_Exception( $message, 9 );
+		return new App_Initialization_Exception($message, 8);
 	}
 
killedBy: PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App::test_exception_thrown_if_non_valid_middleware_class_passed
Failed asserting that 8 is equal to expected exception code 9.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
