[Killed] PublicVisibility
Services/Dice/PinkCrab_Dice.php:56:2
 	 * @param Dice $dice
 	 * @return self
 	 */
-	public static function withDice( Dice $dice ): self { // phpcs:disable WordPress.NamingConventions.ValidFunctionName.MethodNameInvalid
+	protected static function withDice(Dice $dice) : self
 		return new PinkCrab_Dice( $dice );
 	}
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_constuctwith_factory
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_constuctwith_factory
Error: Call to protected method PinkCrab\Perique\Services\Dice\PinkCrab_Dice::withDice() from context 'PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:62
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ER

[Killed] LogicalNot
Services/Dice/PinkCrab_Dice.php:68:3
 	 * @return object|null
 	 */
 	public function get( $id ) {
-		if ( ! $this->has( $id ) ) {
+		if ($this->has($id)) {
 			throw new DI_Container_Exception( "{$id} not defined in container", 1 );
 		}
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_can_create_purely_using_autowiring
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_can_create_purely_using_autowiring
PinkCrab\Perique\Exceptions\DI_Container_Exception: PinkCrab\Perique\Tests\Fixtures\Mock_Objects\Sample_Class not defined in container

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:67
/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:141
phpvfscomposer

[Killed] Throw_
Services/Dice/PinkCrab_Dice.php:69:4
 	 */
 	public function get( $id ) {
 		if ( ! $this->has( $id ) ) {
-			throw new DI_Container_Exception( "{$id} not defined in container", 1 );
+			new DI_Container_Exception("{$id} not defined in container", 1);
 		}
 		return $this->create( $id );
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_throws_exception_using_undefined_class_on_get
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_throws_exception_using_undefined_class_on_get
Failed asserting that exception of type "ReflectionException" matches expected exception "PinkCrab\Perique\Exceptions\DI_Container_Exception". Message was: "Class NotAClass does not exist" at
/shared/httpd/php/htdocs/Perqiue-Framework/vendor/level-2/dice/Dice.php:107
/shared/httpd/php/htdocs/Perqiue

[Survived] IncrementInteger
Services/Dice/PinkCrab_Dice.php:69:4
 	 */
 	public function get( $id ) {
 		if ( ! $this->has( $id ) ) {
-			throw new DI_Container_Exception( "{$id} not defined in container", 1 );
+			throw new DI_Container_Exception("{$id} not defined in container", 2);
 		}
 		return $this->create( $id );

[Killed] LogicalAnd
Services/Dice/PinkCrab_Dice.php:84:3
 	public function has( $id ) {
 		$from_dice = $this->dice->getRule( $id );
 		// If set in global rules.
-		if ( array_key_exists( 'substitutions', $from_dice )
-		&& array_key_exists( $id, $from_dice['substitutions'] ) ) {
+		if (array_key_exists('substitutions', $from_dice) || array_key_exists($id, $from_dice['substitutions'])) {] ) ) {
 			return true;
 		}
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_can_create_purely_using_autowiring
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_can_create_purely_using_autowiring
Undefined index: substitutions

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:82
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Dice/PinkCrab_Dice.php:66
/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:141
phpvfscomposer:///shared/httpd/php/h

[Killed] TrueValue
Services/Dice/PinkCrab_Dice.php:86:4
 		// If set in global rules.
 		if ( array_key_exists( 'substitutions', $from_dice )
 		&& array_key_exists( $id, $from_dice['substitutions'] ) ) {
-			return true;
+			return false;
 		}
 
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:123
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] TrueValue
Services/Dice/PinkCrab_Dice.php:91:4
 
 		// If set with a replacement instance.
 		if ( array_key_exists( 'instanceOf', $from_dice ) ) {
-			return true;
+			return false;
 		}
 
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
Failed asserting that false is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:132
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.

[Killed] FunctionCall
Services/Dice/PinkCrab_Dice.php:95:3
 		}
 
 		// Checks if the class exists
-		return class_exists( $id );
+		class_exists($id);
+        return null;
 	}
 
killedBy: PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
statusReason: 1) PinkCrab\Perique\Tests\DI\Test_PinkCrab_Dice::test_has
Failed asserting that null is true.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/DI/Test_PinkCrab_Dice.php:135
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 3, Failures: 1.
