[Killed] PublicVisibility
Services/Registration/Middleware/Hookable_Middleware.php:44:2
 	 * @param Hook_Loader $loader
 	 * @return void
 	 */
-	public function set_hook_loader( Hook_Loader $loader ):void {
+	protected function set_hook_loader(Hook_Loader $loader) : void
 		$this->loader = $loader;
 	}
killedBy: PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_can_be_constructed_with_loader
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_can_be_constructed_with_loader
Error: Call to protected method PinkCrab\Perique\Services\Registration\Middleware\Hookable_Middleware::set_hook_loader() from context 'PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registerable_Middleware.php:29
php

[Killed] Ternary
Services/Registration/Middleware/Hookable_Middleware.php:55:3
 	 * @return object
 	 */
 	public function process( $class ) {
-		if ( in_array( Hookable::class, class_implements( $class ) ?: array(), true ) ) {
+		if (in_array(Hookable::class, class_implements($class) ? array() : class_implements($class), true)) {
 			/** @phpstan-ignore-next-line class must implement register for interface*/
 			$class->register( $this->loader );
killedBy: PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_only_processes_classes_that_implement_hookable
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_only_processes_classes_that_implement_hookable
Failed asserting that actual size 0 matches expected size 1.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registerable_Middleware.php:48
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertio

[Killed] MethodCallRemoval
Services/Registration/Middleware/Hookable_Middleware.php:57:4
 	public function process( $class ) {
 		if ( in_array( Hookable::class, class_implements( $class ) ?: array(), true ) ) {
 			/** @phpstan-ignore-next-line class must implement register for interface*/
-			$class->register( $this->loader );
+			
 		}
 		return $class;
killedBy: PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_only_processes_classes_that_implement_hookable
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Hookable_Middleware::test_only_processes_classes_that_implement_hookable
Failed asserting that actual size 0 matches expected size 1.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registerable_Middleware.php:48
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertio
