[Killed] PublicVisibility
Services/Registration/Registration_Service.php:68:2
 	 * @param DI_Container $di_container
 	 * @return self
 	 */
-	public function set_container( DI_Container $di_container ): self {
+	protected function set_container(DI_Container $di_container) : self
 		$this->di_container = $di_container;
 		return $this;
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Validation::test_alread_booted_app_fails_validataion
Error: Call to protected method PinkCrab\Perique\Services\Registration\Registration_Service::set_container() from context 'PinkCrab\Perique\Application\App'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:254
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/Test_App_V

[Killed] PublicVisibility
Services/Registration/Registration_Service.php:90:2
 	 * @param Registration_Middleware $middleware
 	 * @return self
 	 */
-	public function push_middleware( Registration_Middleware $middleware ): self {
+	protected function push_middleware(Registration_Middleware $middleware) : self
 		$this->middleware[ \get_class( $middleware ) ] = $middleware;
 		return $this;
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_push_middleware_to_internal_stack
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_push_middleware_to_internal_stack
Error: Call to protected method PinkCrab\Perique\Services\Registration\Registration_Service::push_middleware() from context 'PinkCrab\Perique\Tests\Registration\Test_Registration_Service'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:47
phpvfscompo

[Killed] PublicVisibility
Services/Registration/Registration_Service.php:101:2
 	 * @param array<string> $class_list
 	 * @return self
 	 */
-	public function set_classes( array $class_list ): self {
+	protected function set_classes(array $class_list) : self
 		$this->class_list = $class_list;
 		return $this;
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_can_set_classes_to_registation_service
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_can_set_classes_to_registation_service
Error: Call to protected method PinkCrab\Perique\Services\Registration\Registration_Service::set_classes() from context 'PinkCrab\Perique\Tests\Registration\Test_Registration_Service'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:68
phpvfscomp

[Killed] PublicVisibility
Services/Registration/Registration_Service.php:112:2
 	 * @param string $class
 	 * @return self
 	 */
-	public function push_class( string $class ): self {
+	protected function push_class(string $class) : self
 		$this->class_list[] = $class;
 		return $this;
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_can_push_class_to_registration_service
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_can_push_class_to_registration_service
Error: Call to protected method PinkCrab\Perique\Services\Registration\Registration_Service::push_class() from context 'PinkCrab\Perique\Tests\Registration\Test_Registration_Service'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:81
phpvfscompo

[Killed] PublicVisibility
Services/Registration/Registration_Service.php:122:2
 	 *
 	 * @return void
 	 */
-	public function process(): void {
+	protected function process() : void
 		// Filter all classes, before processing.
 		$class_list = apply_filters( Hooks::APP_INIT_REGISTRATION_CLASS_LIST, $this->class_list );
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
Error: Call to protected method PinkCrab\Perique\Services\Registration\Registration_Service::process() from context 'PinkCrab\Perique\Tests\Registration\Test_Registration_Service'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:103
phpvfscomposer:///sha

[Killed] LogicalAnd
Services/Registration/Registration_Service.php:128:4
 		foreach ( $this->middleware as $middleware ) {
 
 			// Set the container if requested.
-			if ( is_object( $middleware ) && \method_exists( $middleware, 'set_di_container' ) ) {
+			if (is_object($middleware) || \method_exists($middleware, 'set_di_container')) {
 				$middleware->set_di_container( $this->di_container );
 			}
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Functional::test_hookable_middleware_is_included_automatically
Error: Call to undefined method PinkCrab\Perique\Services\Registration\Middleware\Hookable_Middleware::set_di_container()

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Registration/Registration_Service.php:122
/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App.php:33

[Killed] MethodCallRemoval
Services/Registration/Registration_Service.php:129:5
 
 			// Set the container if requested.
 			if ( is_object( $middleware ) && \method_exists( $middleware, 'set_di_container' ) ) {
-				$middleware->set_di_container( $this->di_container );
+				
 			}
 
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
Failed asserting that an array contains 'PinkCrab\Perique\Services\Dice\PinkCrab_Dice'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:151
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1

[Killed] LogicalAnd
Services/Registration/Registration_Service.php:133:4
 			}
 
 			// Set the hook loader if requested.
-			if ( is_object( $middleware ) && \method_exists( $middleware, 'set_hook_loader' ) && ! is_null( $this->loader ) ) {
+			if (is_object($middleware) && \method_exists($middleware, 'set_hook_loader') || !is_null($this->loader)) {
 				$middleware->set_hook_loader( $this->loader );
 			}
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Mock_Objects/Mock_Registration_Middleware.php:77
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Registration/Registration_Service.php:126
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:

[Killed] LogicalNot
Services/Registration/Registration_Service.php:133:4
 			}
 
 			// Set the hook loader if requested.
-			if ( is_object( $middleware ) && \method_exists( $middleware, 'set_hook_loader' ) && ! is_null( $this->loader ) ) {
+			if (is_object($middleware) && \method_exists($middleware, 'set_hook_loader') && is_null($this->loader)) {
 				$middleware->set_hook_loader( $this->loader );
 			}
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Mock_Objects/Mock_Registration_Middleware.php:77
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/Registration/Registration_Service.php:126
/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:

[Killed] MethodCallRemoval
Services/Registration/Registration_Service.php:134:5
 
 			// Set the hook loader if requested.
 			if ( is_object( $middleware ) && \method_exists( $middleware, 'set_hook_loader' ) && ! is_null( $this->loader ) ) {
-				$middleware->set_hook_loader( $this->loader );
+				
 			}
 
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
Failed asserting that an array contains 'PinkCrab\Loader\Hook_Loader'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:152
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 6,

[Killed] MethodCallRemoval
Services/Registration/Registration_Service.php:138:4
 			}
 
 			// Run middleware setup
-			$middleware->setup();
+			
 
 			// Pass each class to the middleware.
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
Failed asserting that an array contains 'setup'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:147
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] Foreach_
Services/Registration/Registration_Service.php:141:4
 			$middleware->setup();
 
 			// Pass each class to the middleware.
-			foreach ( $class_list as $class ) {
-				// Construct class using container,
-				$class_instance = $this->di_container->create( $class );
-
-				// if valid object process via current middleware
-				if ( is_object( $class_instance ) ) {
-					$middleware->process( $class_instance );
-				}
-			}
+			foreach (array() as $class) {
 
 			// Run middleware setup
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
Failed asserting that '' matches PCRE pattern "/Parent_Dependency/".

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Services/Registration/Registration_Service.php:147:6
 
 				// if valid object process via current middleware
 				if ( is_object( $class_instance ) ) {
-					$middleware->process( $class_instance );
+					
 				}
 			}
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_process_registation_middleware
Failed asserting that '' matches PCRE pattern "/Parent_Dependency/".

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.

[Killed] MethodCallRemoval
Services/Registration/Registration_Service.php:152:4
 			}
 
 			// Run middleware setup
-			$middleware->tear_down();
+			
 		}
 	}
killedBy: PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
statusReason: 1) PinkCrab\Perique\Tests\Registration\Test_Registration_Service::test_middleware_setup_and_tear_down
Failed asserting that an array contains 'tear_down'.

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Registration/Test_Registration_Service.php:148
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 2, Failures: 1.
