[Killed] PublicVisibility
Services/View/Component/Component.php:35:2
 	 *
 	 * @return array<string, mixed>
 	 */
-	public function get_variables(): array {
+	protected function get_variables() : array
 		// Get all Private, public and protected properties.
 		$reflect = new \ReflectionClass( get_class( $this ) );
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Error: Call to protected method PinkCrab\Perique\Services\View\Component\Component::get_variables() from context 'PinkCrab\Perique\Services\View\Component\Component_Compiler'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component_Compiler.php:65
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test

[Killed] BitwiseOr
Services/View/Component/Component.php:40:3
 		$reflect = new \ReflectionClass( get_class( $this ) );
 		$vars    = array();
 
-		foreach ( $reflect->getProperties( \ReflectionProperty::IS_PUBLIC | \ReflectionProperty::IS_PRIVATE | \ReflectionProperty::IS_PROTECTED )
+		foreach ($reflect->getProperties(\ReflectionProperty::IS_PUBLIC & \ReflectionProperty::IS_PRIVATE | \ReflectionProperty::IS_PROTECTED) as $var) {
 			as $var
 		) {
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Undefined index: name

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:49
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] BitwiseOr
Services/View/Component/Component.php:40:3
 		$reflect = new \ReflectionClass( get_class( $this ) );
 		$vars    = array();
 
-		foreach ( $reflect->getProperties( \ReflectionProperty::IS_PUBLIC | \ReflectionProperty::IS_PRIVATE | \ReflectionProperty::IS_PROTECTED )
+		foreach ($reflect->getProperties((\ReflectionProperty::IS_PUBLIC | \ReflectionProperty::IS_PRIVATE) & \ReflectionProperty::IS_PROTECTED) as $var) {
 			as $var
 		) {
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Undefined index: name

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:49
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 1, Errors: 1.

[Killed] MethodCallRemoval
Services/View/Component/Component.php:43:4
 		foreach ( $reflect->getProperties( \ReflectionProperty::IS_PUBLIC | \ReflectionProperty::IS_PRIVATE | \ReflectionProperty::IS_PROTECTED )
 			as $var
 		) {
-			$var->setAccessible( true );
+			
 			$vars[ $var->getName() ] = $var->getValue( $this );
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
ReflectionException: Cannot access non-public member PinkCrab\Perique\Tests\Fixtures\Mock_Objects\View_Components\Input::$id

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component.php:40
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component_Compiler.php:65
/shared/httpd/php/ht

[Killed] TrueValue
Services/View/Component/Component.php:43:4
 		foreach ( $reflect->getProperties( \ReflectionProperty::IS_PUBLIC | \ReflectionProperty::IS_PRIVATE | \ReflectionProperty::IS_PROTECTED )
 			as $var
 		) {
-			$var->setAccessible( true );
+			$var->setAccessible(false);
 			$vars[ $var->getName() ] = $var->getValue( $this );
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
ReflectionException: Cannot access non-public member PinkCrab\Perique\Tests\Fixtures\Mock_Objects\View_Components\Input::$id

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component.php:40
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component_Compiler.php:65
/shared/httpd/php/ht

[Killed] PublicVisibility
Services/View/Component/Component.php:55:2
 	 *
 	 * @return string|null
 	 */
-	public function template(): ?string {
+	protected function template() : ?string
 		return null;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Error: Call to protected method PinkCrab\Perique\Services\View\Component\Component::template() from context 'PinkCrab\Perique\Services\View\Component\Component_Compiler'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Component/Component_Compiler.php:90
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/Co
