[Killed] PublicVisibility
Services/View/Component/Component_Compiler.php:64:2
 	 * @param Component $component
 	 * @return View_Model
 	 */
-	public function compile( Component $component ): View_Model {
+	protected function compile(Component $component) : View_Model
 		return new View_Model( $this->get_component_path( $component ), $component->get_variables() );
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Error: Call to protected method PinkCrab\Perique\Services\View\Component\Component_Compiler::compile() from context 'PinkCrab\Perique\Tests\View\Test_Components'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:47
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:

[Killed] LogicalNot
Services/View/Component/Component_Compiler.php:85:3
 
 		$from_annotation = $this->get_annotation( 'view', $component );
 		// If it does have a path defined, use that.
-		if ( ! empty( $from_annotation ) ) {
+		if (empty($from_annotation)) {
 			return \trailingslashit( $this->component_base_path ) . $from_annotation;
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/'

[Killed] ConcatOperandRemoval
Services/View/Component/Component_Compiler.php:86:4
 		$from_annotation = $this->get_annotation( 'view', $component );
 		// If it does have a path defined, use that.
 		if ( ! empty( $from_annotation ) ) {
-			return \trailingslashit( $this->component_base_path ) . $from_annotation;
+			return $from_annotation;
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'from/attribute/path'

[Killed] Concat
Services/View/Component/Component_Compiler.php:86:4
 		$from_annotation = $this->get_annotation( 'view', $component );
 		// If it does have a path defined, use that.
 		if ( ! empty( $from_annotation ) ) {
-			return \trailingslashit( $this->component_base_path ) . $from_annotation;
+			return $from_annotation . \trailingslashit($this->component_base_path);
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'from/attribute/path/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/'

[Killed] ConcatOperandRemoval
Services/View/Component/Component_Compiler.php:91:4
 
 		// If the component has a defined path
 		if ( $component->template() ) {
-			return \trailingslashit( $this->component_base_path ) . $component->template();
+			return $component->template();
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/path/to/template'
+'path/to/template'

[Killed] ConcatOperandRemoval
Services/View/Component/Component_Compiler.php:91:4
 
 		// If the component has a defined path
 		if ( $component->template() ) {
-			return \trailingslashit( $this->component_base_path ) . $component->template();
+			return \trailingslashit($this->component_base_path);
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/path/to/template'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/'

[Killed] UnwrapStrToLower
Services/View/Component/Component_Compiler.php:98:3
 		$reflect    = new \ReflectionClass( $component );
 		$short_name = $reflect->getShortName();
 		// Add space between capitals, make lowercase and replace underscores with dashes.
-		$short_name = strtolower( preg_replace( '/(?<!^)[A-Z]/', '-$0', $short_name ) ?? '' );
+		$short_name = preg_replace('/(?<!^)[A-Z]/', '-$0', $short_name) ?? '';
 		$short_name = str_replace( '_', '-', $short_name );
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/Input'

[Killed] Coalesce
Services/View/Component/Component_Compiler.php:98:3
 		$reflect    = new \ReflectionClass( $component );
 		$short_name = $reflect->getShortName();
 		// Add space between capitals, make lowercase and replace underscores with dashes.
-		$short_name = strtolower( preg_replace( '/(?<!^)[A-Z]/', '-$0', $short_name ) ?? '' );
+		$short_name = strtolower('' ?? preg_replace('/(?<!^)[A-Z]/', '-$0', $short_name));
 		$short_name = str_replace( '_', '-', $short_name );
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/'

[Survived] UnwrapStrReplace
Services/View/Component/Component_Compiler.php:99:3
 		$short_name = $reflect->getShortName();
 		// Add space between capitals, make lowercase and replace underscores with dashes.
 		$short_name = strtolower( preg_replace( '/(?<!^)[A-Z]/', '-$0', $short_name ) ?? '' );
-		$short_name = str_replace( '_', '-', $short_name );
+		$short_name = $short_name;
 
 		return \trailingslashit( $this->component_base_path ) . $short_name;

[Killed] ConcatOperandRemoval
Services/View/Component/Component_Compiler.php:101:3
 		$short_name = strtolower( preg_replace( '/(?<!^)[A-Z]/', '-$0', $short_name ) ?? '' );
 		$short_name = str_replace( '_', '-', $short_name );
 
-		return \trailingslashit( $this->component_base_path ) . $short_name;
+		return $short_name;
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input'
+'input'

[Killed] ConcatOperandRemoval
Services/View/Component/Component_Compiler.php:101:3
 		$short_name = strtolower( preg_replace( '/(?<!^)[A-Z]/', '-$0', $short_name ) ?? '' );
 		$short_name = str_replace( '_', '-', $short_name );
 
-		return \trailingslashit( $this->component_base_path ) . $short_name;
+		return \trailingslashit($this->component_base_path);
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/'

[Killed] NotIdentical
Services/View/Component/Component_Compiler.php:121:3
 		}
 
 		// If comment contains the annotation, return the value.
-		return strpos( $comment, "@{$annotation}" ) !== false
+		return strpos($comment, "@{$annotation}") === false ? $this->extract_annotation_value($comment, $annotation) : null;
 			? $this->extract_annotation_value( $comment, $annotation )
 			: null;
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input--attribute--path'

[Killed] Ternary
Services/View/Component/Component_Compiler.php:121:3
 		}
 
 		// If comment contains the annotation, return the value.
-		return strpos( $comment, "@{$annotation}" ) !== false
-			? $this->extract_annotation_value( $comment, $annotation )
-			: null;
+		return strpos($comment, "@{$annotation}") !== false ? null : $this->extract_annotation_value($comment, $annotation);
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input--attribute--path'

[Killed] PregMatchMatches
Services/View/Component/Component_Compiler.php:135:3
 	 */
 	private function extract_annotation_value( string $comment, string $annotation ): ?string {
 		$pattern = "/@{$annotation}\s+(.*)/";
-		preg_match( $pattern, $comment, $matches );
+		(int) ($matches = array());
 		return $matches[1] ?? null;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input--attribute--path'

[Killed] FunctionCallRemoval
Services/View/Component/Component_Compiler.php:135:3
 	 */
 	private function extract_annotation_value( string $comment, string $annotation ): ?string {
 		$pattern = "/@{$annotation}\s+(.*)/";
-		preg_match( $pattern, $comment, $matches );
+		
 		return $matches[1] ?? null;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input--attribute--path'

[Killed] DecrementInteger
Services/View/Component/Component_Compiler.php:136:3
 	private function extract_annotation_value( string $comment, string $annotation ): ?string {
 		$pattern = "/@{$annotation}\s+(.*)/";
 		preg_match( $pattern, $comment, $matches );
-		return $matches[1] ?? null;
+		return $matches[0] ?? null;
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/@view from/attribute/path'

[Killed] IncrementInteger
Services/View/Component/Component_Compiler.php:136:3
 	private function extract_annotation_value( string $comment, string $annotation ): ?string {
 		$pattern = "/@{$annotation}\s+(.*)/";
 		preg_match( $pattern, $comment, $matches );
-		return $matches[1] ?? null;
+		return $matches[2] ?? null;
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_assume_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/from/attribute/path'
+'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/input--attribute--path'
