[Killed] TrueValue
Services/View/PHP_Engine.php:76:2
 	 * @param bool $print
 	 * @return string|void
 	 */
-	public function render( string $view, iterable $data, bool $print = true ) {
+	public function render(string $view, iterable $data, bool $print = false)
 		$view = $this->resolve_file_path( $view );
 		if ( $print ) {
killedBy: PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_render_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_render_single_template
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Hello World'
+''

[Killed] TrueValue
Services/View/PHP_Engine.php:91:2
 	 * @param Component $component
 	 * @return string|void
 	 */
-	public function component( Component $component, bool $print = true ) {
+	public function component(Component $component, bool $print = false)
 
 		// Throw exception of no compiler passed.
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_render_component_inside_component
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_render_component_inside_component
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'<p class="class_p"><span class="class_s">value_s</span></p>'
+'<p class="class_p"></p>'

[Killed] LogicalNot
Services/View/PHP_Engine.php:94:3
 	public function component( Component $component, bool $print = true ) {
 
 		// Throw exception of no compiler passed.
-		if ( ! is_a( $this->component_compiler, Component_Compiler::class ) ) {
+		if (is_a($this->component_compiler, Component_Compiler::class)) {
 			throw new Exception( 'No component compiler passed to PHP_Engine' );
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
Exception: No component compiler passed to PHP_Engine

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:91
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:92
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:80
phpvfscomposer:///shared/httpd/php/htdocs/P

[Killed] Throw_
Services/View/PHP_Engine.php:95:4
 
 		// Throw exception of no compiler passed.
 		if ( ! is_a( $this->component_compiler, Component_Compiler::class ) ) {
-			throw new Exception( 'No component compiler passed to PHP_Engine' );
+			new Exception('No component compiler passed to PHP_Engine');
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_if_component_not_set
statusReason: 1) PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_if_component_not_set
Failed asserting that exception of type "Error" matches expected exception "Exception". Message was: "Call to a member function compile() on null" at
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:94
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_PHP_Engine.php:167
ph

[Survived] UnwrapLtrim
Services/View/PHP_Engine.php:101:3
 		// Compile the component.
 		$compiled = $this->component_compiler->compile( $component );
 		$template = $this->maybe_resolve_dot_notation( $compiled->template() );
-		$view     = sprintf( '%s%s.php', \DIRECTORY_SEPARATOR, ltrim( $template ) );
+		$view = sprintf('%s%s.php', \DIRECTORY_SEPARATOR, $template);
 		if ( $print ) {
 			print( $this->render_buffer( $view, $compiled->data() ) ); // phpcs:ignore WordPress.Security.EscapeOutput.OutputNotEscaped

[Survived] TrueValue
Services/View/PHP_Engine.php:116:2
 	 * @param View_Model $view_model
 	 * @return string|void
 	 */
-	public function view_model( View_Model $view_model, bool $print = true ) {
+	public function view_model(View_Model $view_model, bool $print = false)
 		return $this->render( $view_model->template(), $view_model->data(), $print );
 	}

[Survived] PublicVisibility
Services/View/PHP_Engine.php:128:2
 	 * @param bool $print
 	 * @return string|void
 	 */
-	public function partial( string $view, iterable $data = array(), bool $print = true ) {
+	protected function partial(string $view, iterable $data = array(), bool $print = true)
 		if ( $print ) {
 			$this->render( $view, $data, $print );

[Survived] TrueValue
Services/View/PHP_Engine.php:128:2
 	 * @param bool $print
 	 * @return string|void
 	 */
-	public function partial( string $view, iterable $data = array(), bool $print = true ) {
+	public function partial(string $view, iterable $data = array(), bool $print = false)
 		if ( $print ) {
 			$this->render( $view, $data, $print );

[Killed] MethodCallRemoval
Services/View/PHP_Engine.php:130:4
 	 */
 	public function partial( string $view, iterable $data = array(), bool $print = true ) {
 		if ( $print ) {
-			$this->render( $view, $data, $print );
+			
 		} else {
 			return $this->render( $view, $data, $print );
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_render_partial_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_render_partial_template
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'partial_value'
+''

[Survived] ProtectedVisibility
Services/View/PHP_Engine.php:144:2
 	 * @return string
 	 * @throws Exception
 	 */
-	protected function render_buffer( string $view, iterable $__data ): string {
+	private function render_buffer(string $view, iterable $__data) : string
 
 		if ( ! file_exists( $view ) ) {

[Killed] LogicalNot
Services/View/PHP_Engine.php:146:3
 	 */
 	protected function render_buffer( string $view, iterable $__data ): string {
 
-		if ( ! file_exists( $view ) ) {
+		if (file_exists($view)) {
 			throw new Exception( "{$view} doesn't exist" );
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Exception: /shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/hello.php doesn't exist

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:141
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:78
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:8

[Killed] Throw_
Services/View/PHP_Engine.php:147:4
 	protected function render_buffer( string $view, iterable $__data ): string {
 
 		if ( ! file_exists( $view ) ) {
-			throw new Exception( "{$view} doesn't exist" );
+			new Exception("{$view} doesn't exist");
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_if_view_not_found
statusReason: 1) PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_if_view_not_found
fopen(/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/DOESNT_EXIST.php): failed to open stream: No such file or directory

/home/devilbox/.composer/vendor/infection/include-interceptor/src/IncludeInterceptor.php:113
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:155

[Killed] FunctionCallRemoval
Services/View/PHP_Engine.php:151:3
 		}
 
 		$output = '';
-		ob_start();
+		
 
 		// Set all the data values a parameters.
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_render_partial_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_render_partial_template
ob_end_clean(): failed to delete buffer. No buffer to delete

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:157
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:75
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:81
/shared/httpd/php/htdocs/Perqiue-Fr

[Killed] Foreach_
Services/View/PHP_Engine.php:154:3
 		ob_start();
 
 		// Set all the data values a parameters.
-		foreach ( $__data as $__key => $__value ) {
-			if ( is_string( $__key ) ) {
-				${\wp_strip_all_tags( $__key )} = $__value;
-			}
-
-			// Unset the key and value.
-			unset( $__key, $__value );
-		}
+		foreach (array() as $__key => $__value) {
 
 		// Unset the data.
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Undefined variable: hello

/shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/hello.php:3
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:155
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:78
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.ph

[Killed] FunctionCallRemoval
Services/View/PHP_Engine.php:168:3
 
 		include $view;
 		$output = ob_get_contents();
-		ob_end_clean();
+		
 		return $output ?: '';
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_render_component_inside_component
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_render_component_inside_component
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'<p class="class_p"><span class="class_s">value_s</span></p>'
+'<span class="class_s">value_s</span><span class="class_s">value_s</span></p>'

[Killed] Ternary
Services/View/PHP_Engine.php:169:3
 		include $view;
 		$output = ob_get_contents();
 		ob_end_clean();
-		return $output ?: '';
+		return $output ? '' : $output;
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'Hello World'
+''

[Survived] ProtectedVisibility
Services/View/PHP_Engine.php:178:2
 	 * @param string $filename
 	 * @return string
 	 */
-	protected function resolve_file_path( string $filename ): string {
+	private function resolve_file_path(string $filename) : string
 		$filename = $this->maybe_resolve_dot_notation( $filename );
 		return sprintf(

[Survived] UnwrapLtrim
Services/View/PHP_Engine.php:183:4
 		return sprintf(
 			'%s%s.php',
 			$this->base_view_path,
-			ltrim( $filename )
+			return sprintf('%s%s.php', $this->base_view_path, $filename);
 		);
 	}

[Survived] ProtectedVisibility
Services/View/PHP_Engine.php:193:2
 	 * @param string $filename
 	 * @return string
 	 */
-	protected function maybe_resolve_dot_notation( string $filename ): string {
+	private function maybe_resolve_dot_notation(string $filename) : string
 		if ( $this->str_ends_with( '.php', $filename ) ) {
 			$filename = substr( $filename, 0, -4 );

[Killed] IncrementInteger
Services/View/PHP_Engine.php:195:4
 	 */
 	protected function maybe_resolve_dot_notation( string $filename ): string {
 		if ( $this->str_ends_with( '.php', $filename ) ) {
-			$filename = substr( $filename, 0, -4 );
+			$filename = substr($filename, 0, -3);
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_add_component_aliases_after_setup
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_add_component_aliases_after_setup
Exception: //shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/other/other/.php doesn't exist

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:141
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:101
/shared/httpd/php/htdocs/Perqi

[Killed] DecrementInteger
Services/View/PHP_Engine.php:195:4
 	 */
 	protected function maybe_resolve_dot_notation( string $filename ): string {
 		if ( $this->str_ends_with( '.php', $filename ) ) {
-			$filename = substr( $filename, 0, -4 );
+			$filename = substr($filename, 0, -5);
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_add_component_aliases_after_setup
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_add_component_aliases_after_setup
Exception: //shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/components/other/othe.php doesn't exist

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:141
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:101
/shared/httpd/php/htdocs/Perqiue

[Survived] ProtectedVisibility
Services/View/PHP_Engine.php:211:2
 	 * @param string $haystack
 	 * @return bool
 	 */
-	protected function str_ends_with( string $needle, string $haystack ): bool {
+	private function str_ends_with(string $needle, string $haystack) : bool
 		$needle_len = strlen( $needle );
 		return ( $needle_len === 0 || 0 === substr_compare( $haystack, $needle, - $needle_len ) );

[Killed] Identical
Services/View/PHP_Engine.php:213:3
 	 */
 	protected function str_ends_with( string $needle, string $haystack ): bool {
 		$needle_len = strlen( $needle );
-		return ( $needle_len === 0 || 0 === substr_compare( $haystack, $needle, - $needle_len ) );
+		return $needle_len === 0 || 0 !== substr_compare($haystack, $needle, -$needle_len);
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
Exception: /shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Vi/ doesn't exist and cant be used as the base view path.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:210
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:51
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View

[Killed] Identical
Services/View/PHP_Engine.php:213:3
 	 */
 	protected function str_ends_with( string $needle, string $haystack ): bool {
 		$needle_len = strlen( $needle );
-		return ( $needle_len === 0 || 0 === substr_compare( $haystack, $needle, - $needle_len ) );
+		return $needle_len !== 0 || 0 === substr_compare($haystack, $needle, -$needle_len);
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
Exception: /shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Vi/ doesn't exist and cant be used as the base view path.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:210
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:51
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View

[Survived] ProtectedVisibility
Services/View/PHP_Engine.php:224:2
 	 * @return string
 	 * @throws Exception
 	 */
-	protected function verify_view_path( string $path ): string {
+	private function verify_view_path(string $path) : string
 		$path = $this->maybe_resolve_dot_notation( $path );
 		$path = rtrim( $path, '/' ) . '/';

[Killed] ConcatOperandRemoval
Services/View/PHP_Engine.php:226:3
 	 */
 	protected function verify_view_path( string $path ): string {
 		$path = $this->maybe_resolve_dot_notation( $path );
-		$path = rtrim( $path, '/' ) . '/';
+		$path = '/';
 
 		if ( ! \is_dir( $path ) ) {
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Exception: /hello.php doesn't exist

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:141
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:78
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:81
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Vi

[Killed] ConcatOperandRemoval
Services/View/PHP_Engine.php:226:3
 	 */
 	protected function verify_view_path( string $path ): string {
 		$path = $this->maybe_resolve_dot_notation( $path );
-		$path = rtrim( $path, '/' ) . '/';
+		$path = rtrim($path, '/');
 
 		if ( ! \is_dir( $path ) ) {
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Exception: /shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Viewshello.php doesn't exist

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:141
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:78
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:81

[Killed] LogicalNot
Services/View/PHP_Engine.php:228:3
 		$path = $this->maybe_resolve_dot_notation( $path );
 		$path = rtrim( $path, '/' ) . '/';
 
-		if ( ! \is_dir( $path ) ) {
+		if (\is_dir($path)) {
 			throw new Exception( "{$path} doesn't exist and cant be used as the base view path." );
 		}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
Exception: /shared/httpd/php/htdocs/Perqiue-Framework/tests/Fixtures/Views/ doesn't exist and cant be used as the base view path.

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:210
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:51
/shared/httpd/php/htdocs/Perqiue-Framework/tests/V

[Killed] Throw_
Services/View/PHP_Engine.php:229:4
 		$path = rtrim( $path, '/' ) . '/';
 
 		if ( ! \is_dir( $path ) ) {
-			throw new Exception( "{$path} doesn't exist and cant be used as the base view path." );
+			new Exception("{$path} doesn't exist and cant be used as the base view path.");
 		}
 
killedBy: PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_view_dir_not_exists
statusReason: 1) PinkCrab\Perique\Tests\View\Test_PHP_Engine::test_throws_exception_view_dir_not_exists
Failed asserting that exception of type "Exception" is thrown.

phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

FAILURES!
Tests: 1, Assertions: 1, Failures: 1.
