[Killed] MethodCallRemoval
Services/View/View.php:69:3
 		$this->component_compiler = $component_compiler;
 
 		// Populate engine with compiler.
-		$this->engine->set_component_compiler( $component_compiler );
+		
 	}
 
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
Exception: No component compiler passed to PHP_Engine

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:95
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:83
/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:80
phpvfscomposer:///shared/httpd/php/htdocs/P

[Killed] PublicVisibility
Services/View/View.php:80:2
 	 * @param bool $print Print or Return the HTML
 	 * @return string|void
 	 */
-	public function render( string $view, iterable $view_data = array(), bool $print = self::PRINT_VIEW ) {
+	protected function render(string $view, iterable $view_data = array(), bool $print = self::PRINT_VIEW)
 		return $this->engine->render( $view, $view_data, $print );
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_single_template
Error: Call to protected method PinkCrab\Perique\Services\View\View::render() from context 'PinkCrab\Perique\Tests\View\Test_View'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_View.php:73
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0,

[Killed] PublicVisibility
Services/View/View.php:91:2
 	 * @param bool $print Print or Return the HTML
 	 * @return string|void
 	 */
-	public function component( Component $component, bool $print = self::PRINT_VIEW ) {
+	protected function component(Component $component, bool $print = self::PRINT_VIEW)
 		return $this->engine->component( $component, $print );
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
statusReason: 1) PinkCrab\Perique\Tests\View\Test_Components::test_can_print_component
Error: Call to protected method PinkCrab\Perique\Services\View\View::component() from context 'PinkCrab\Perique\Tests\View\Test_Components'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_Components.php:80
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests:

[Killed] PublicVisibility
Services/View/View.php:102:2
 	 * @param bool $print Print or Return the HTML
 	 * @return string|void
 	 */
-	public function view_model( View_Model $view_model, bool $print = self::PRINT_VIEW ) {
+	protected function view_model(View_Model $view_model, bool $print = self::PRINT_VIEW)
 		return $this->engine->view_model( $view_model, $print );
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
Error: Call to protected method PinkCrab\Perique\Services\View\View::view_model() from context 'PinkCrab\Perique\Tests\View\Test_View'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_View.php:103
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0,

[Killed] PublicVisibility
Services/View/View.php:112:2
 	 * @param callable $to_buffer
 	 * @return string
 	 */
-	public static function print_buffer( callable $to_buffer ): string {
+	protected static function print_buffer(callable $to_buffer) : string
 		ob_start();
 		$to_buffer();
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
Error: Call to protected method PinkCrab\Perique\Services\View\View::print_buffer() from context 'PinkCrab\Perique\Tests\View\Test_View'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_View.php:49
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0, Err

[Killed] FunctionCallRemoval
Services/View/View.php:113:3
 	 * @return string
 	 */
 	public static function print_buffer( callable $to_buffer ): string {
-		ob_start();
+		
 		$to_buffer();
 		$output = ob_get_contents();
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: Installing...
Running as single site... To run multisite, use -c tests/phpunit/multisite.xml
Not running ajax tests. To execute these, use --group ajax.
Not running ms-files tests. To execute these, use --group ms-files.
Not running external-http tests. To execute these, use --group external-http.
PHPUnit 8.5.33 by Sebastian Bergmann and contributors.

R......

[Killed] FunctionCallRemoval
Services/View/View.php:114:3
 	 */
 	public static function print_buffer( callable $to_buffer ): string {
 		ob_start();
-		$to_buffer();
+		
 		$output = ob_get_contents();
 		ob_end_clean();
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_print_buffer
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'ECHO...ECHO'
+''

[Killed] PublicVisibility
Services/View/View.php:125:2
 	 *
 	 * @return Renderable
 	 */
-	public function engine(): Renderable {
+	protected function engine() : Renderable
 		return $this->engine;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_get_internal_engine
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_get_internal_engine
Error: Call to protected method PinkCrab\Perique\Services\View\View::engine() from context 'PinkCrab\Perique\Tests\View\Test_View'

/shared/httpd/php/htdocs/Perqiue-Framework/tests/View/Test_View.php:95
phpvfscomposer:///shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/phpunit:97

ERRORS!
Tests: 1, Assertions: 0, Er
