[Killed] PublicVisibility
Services/View/View_Model.php:55:2
 	 *
 	 * @return string
 	 */
-	public function template(): string {
+	protected function template() : string
 		return $this->template;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
Error: Call to protected method PinkCrab\Perique\Services\View\View_Model::template() from context 'PinkCrab\Perique\Services\View\PHP_Engine'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:117
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:103
/shared/httpd/php/htdocs/Perqiue-Fram

[Killed] PublicVisibility
Services/View/View_Model.php:64:2
 	 *
 	 * @return array<string, mixed>
 	 */
-	public function data(): array {
+	protected function data() : array
 		return $this->data;
 	}
killedBy: PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
statusReason: 1) PinkCrab\Perique\Tests\View\Test_View::test_return_view_model
Error: Call to protected method PinkCrab\Perique\Services\View\View_Model::data() from context 'PinkCrab\Perique\Services\View\PHP_Engine'

/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/PHP_Engine.php:117
/shared/httpd/php/htdocs/Perqiue-Framework/src/Services/View/View.php:103
/shared/httpd/php/htdocs/Perqiue-Framewor
