[Killed] Ternary
Application/App_Factory.php:48:4
 
 		if ( null === $base_path ) {
 			$trace           = debug_backtrace(); //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
-			$this->base_path = isset( $trace[0]['file'] ) ? \trailingslashit( dirname( $trace[0]['file'] ) ) : __DIR__;
+			$this->base_path = isset($trace[0]['file']) ? __DIR__ : \trailingslashit(dirname($trace[0]['file']));
 		} else {
 			$this->base_path = \trailingslashit( $base_path );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/src/Application/'

[Killed] IncrementInteger
Application/App_Factory.php:48:4
 
 		if ( null === $base_path ) {
 			$trace           = debug_backtrace(); //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
-			$this->base_path = isset( $trace[0]['file'] ) ? \trailingslashit( dirname( $trace[0]['file'] ) ) : __DIR__;
+			$this->base_path = isset($trace[0]['file']) ? \trailingslashit(dirname($trace[1]['file'])) : __DIR__;
 		} else {
 			$this->base_path = \trailingslashit( $base_path );
killedBy: PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
statusReason: 1) PinkCrab\Perique\Tests\Application\Test_App_Factory::test_detect_base_path
Failed asserting that two strings are equal.
--- Expected
+++ Actual
@@ @@
-'/shared/httpd/php/htdocs/Perqiue-Framework/tests/Application/'
+'/shared/httpd/php/htdocs/Perqiue-Framework/vendor/phpunit/phpunit/src/Framework/'
