28) /shared/httpd/php/htdocs/Perqiue-Framework/src/Application/App_Factory.php:48    [M] IncrementInteger

--- Original
+++ New
@@ @@
         if (null === $base_path) {
             $trace = debug_backtrace();
             //phpcs:ignore WordPress.PHP.DevelopmentFunctions.error_log_debug_backtrace
-            $this->base_path = isset($trace[0]['file']) ? \trailingslashit(dirname($trace[0]['file'])) : __DIR__;
+            $this->base_path = isset($trace[1]['file']) ? \trailingslashit(dirname($trace[0]['file'])) : __DIR__;
         } else {
             $this->base_path = \trailingslashit($base_path);
         }
